blog/content/post/ai-setup.org
+++
title = "01 - AI Engineering from scratch: a fase zero da engenharia de IA"
description = "Tudo que você precisa configurar antes de escrever uma única linha de PyTorch, do ambiente de desenvolvimento ao debug de NaN loss"
date = 2026-05-27T10:00:00-03:00
tags = ["AI", "setup", "tooling", "python", "go", "docker", "linux", "gpu", "amd", "rocm", "cuda", "debugging"]
draft = true
weight = 1
author = "Vitor Lobo Ramos"
+++


Este artigo é uma parte de uma série de outros artigos que pretendo escrever sobre AI Engineering From Scratch baseados no projeto [[https://github.com/rohitg00/ai-engineering-from-scratch][ai-engineering-from-scratch]] de Rohit Ghumare. Os artigos cobrem de regressão linear a agentes multi-modelo, passando por CNNs (redes convolucionais, as que reconhecem objetos em imagens), transformers (a arquitetura por trás do GPT e do Claude), RAG (Retrieval-Augmented Generation quando você dá documentos de contexto pro LLM antes de perguntar), fine-tuning (ajustar um modelo pré-treinado com seus próprios dados) e inferência em produção (servir o modelo treinado pra usuários reais). E nenhuma delas funciona se o ambiente não estiver pronto.

A stack que vamos usar é Python + Go. Python é o rei do ecossistema de IA, PyTorch, JAX, transformers, datasets, Jupyter, tudo vive aqui. Go é a linguagem pra construir APIs, agentes, servidores MCP e tudo que precisa ser rápido, compilado e deployável com um binário só. Duas linguagens, zero gordura.

* O ambiente de desenvolvimento

Antes de qualquer modelo, antes de qualquer dataset, você precisa de um lugar onde o código /roda/. Não adianta ter o melhor notebook do mundo se o Python não encontra o NumPy, ou se seu agente em Go não compila.

O que vamos fazer aqui: instalar Python (com ~uv~) e Go, nessa ordem. O objetivo é chegar no fim com um terminal onde ~python~ e ~go~ respondem sem erro e você entende /por que/ cada um está ali. Toda stack de engenharia de IA tem camadas. Se uma falha, a culpa cai na de cima e você nunca sabe onde foi o problema:

#+BEGIN_SRC mermaid
graph TD
    A["4. Bibliotecas de IA<br/>PyTorch, JAX, transformers, etc."] --> B["3. Runtimes de linguagem<br/>Python 3.12+, Go 1.23+"]
    B --> C["2. Gerenciadores de pacote<br/>uv, go mod"]
    C --> D["1. Fundação do sistema<br/>OS, shell, git, editor, drivers GPU"]

    classDef l4 fill:#1a1c2e,stroke:#4a4e6b,color:#b8bcd0
    classDef l3 fill:#1e2040,stroke:#525580,color:#c0c4d8
    classDef l2 fill:#222450,stroke:#5a5e90,color:#c8cce0
    classDef l1 fill:#262860,stroke:#6266a0,color:#d0d4e8
    class A l4
    class B l3
    class C l2
    class D l1
#+END_SRC

Em Python, ao menos neste experimento, prefira usar ~uv~ ao invés de ~pip~ por questão de praticidade e performance:

#+BEGIN_SRC bash
curl -LsSf https://astral.sh/uv/install.sh | sh
uv python install 3.12

uv venv
source .venv/bin/activate  # ou .venv\Scripts\activate no Windows

uv pip install numpy matplotlib jupyter
#+END_SRC

Verifique se tudo subiu:

#+BEGIN_SRC python
import sys; print(f"Python {sys.version}")
import numpy as np; print(f"NumPy {np.__version__}")
a = np.array([1, 2, 3])
print(f"Vector: {a}, dot: {np.dot(a, a)}")
#+END_SRC

* Go

Python cuida dos modelos. Go cuida de todo o resto: APIs de LLM, agentes autônomos, servidores MCP, ferramentas de linha de comando, automação de infra. É a linguagem que você usa quando precisa de performance, deploy simples e zero dependência externa.

#+BEGIN_SRC bash
# Linux/macOS
curl -sSL https://go.dev/dl/go1.23.4.linux-amd64.tar.gz | sudo tar -C /usr/local -xz
echo 'export PATH=$PATH:/usr/local/go/bin' >> ~/.bashrc

# Windows (PowerShell como admin)
winget install GoLang.Go.1.23

# Ou via gvm (gerenciador de versões, similar ao fnm)
bash < <(curl -s -S -L https://raw.githubusercontent.com/moovweb/gvm/master/binds/gvm_install)
source ~/.gvm/scripts/gvm
gvm install go1.23.4
gvm use go1.23.4
#+END_SRC

Verifique:

#+BEGIN_SRC bash
go version
# go version go1.23.4 linux/amd64

mkdir -p ~/hello && cd ~/hello
go mod init hello
cat > main.go << 'EOF'
package main
import "fmt"
func main() { fmt.Println("Go pronto pra IA.") }
EOF
go run main.go
#+END_SRC

#+BEGIN_QUOTE
/Em miúdos:/ ~Go~ (ou Golang) foi criada pelo Google pra resolver problemas de infraestrutura em escala. Ela compila em segundos, gera um binário estático (sem dependências externas) e tem concorrência nativa com goroutines, perfeito pra agentes que fazem dezenas de chamadas de API em paralelo. ~MCP~ (Model Context Protocol) é um protocolo aberto da Anthropic que padroniza como agentes de IA se conectam a ferramentas externas (bancos de dados, APIs, sistemas de arquivos), Go é uma das linguagens mais usadas pra implementar servidores MCP. ~Go modules~ (~go mod~) é o gerenciador de dependências nativo do Go, similar ao ~uv~ no Python.
#+END_QUOTE

#+BEGIN_QUOTE
/Saiba mais:/ se seu terminal diz "command not found" depois de instalar, você provavelmente esqueceu de reiniciar o shell ou rodar o ~source~ do profile. Acontece com todo mundo.
#+END_QUOTE

