ai-setup/index.html
<!DOCTYPE html>
<html lang="pt-br">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <link rel="icon" href="data:,">
  <title>01 - AI Engineering from scratch: a fase zero da engenharia de IA — lobovit</title>
  <link rel="stylesheet" href="/css/main.css?v=3">
  <link rel="stylesheet" href="/vendor/fonts/fonts.css">
  <link rel="stylesheet" href="/vendor/prism/prism-mocha.min.css">
</head>
<body>
  <div class="frame">
    <header>
      <nav>
        <a class="site-title" href="https://lobovit.github.io/">lobovit</a>
        <span class="nav-links">
          <a href="/page/about/">about</a>
          <a href="/page/contact/">contact</a>
        </span>
      </nav>
      <hr>
    </header>
    <main>
      
<article>
  <header>
    <h1>01 - AI Engineering from scratch: a fase zero da engenharia de IA</h1>
    <p class="meta"><time>2026-05-27</time> · <span class="tag">AI</span><span class="tag">setup</span><span class="tag">tooling</span><span class="tag">python</span><span class="tag">go</span><span class="tag">docker</span><span class="tag">linux</span><span class="tag">gpu</span><span class="tag">amd</span><span class="tag">rocm</span><span class="tag">cuda</span><span class="tag">debugging</span></p>
  </header>
  <div class="content">
    
<p>
Este artigo é uma parte de uma série de outros artigos que pretendo escrever sobre AI Engineering From Scratch baseados no projeto <a href="https://github.com/rohitg00/ai-engineering-from-scratch">ai-engineering-from-scratch</a> de Rohit Ghumare. Os artigos cobrem de regressão linear a agentes multi-modelo, passando por CNNs (redes convolucionais, as que reconhecem objetos em imagens), transformers (a arquitetura por trás do GPT e do Claude), RAG (Retrieval-Augmented Generation quando você dá documentos de contexto pro LLM antes de perguntar), fine-tuning (ajustar um modelo pré-treinado com seus próprios dados) e inferência em produção (servir o modelo treinado pra usuários reais). E nenhuma delas funciona se o ambiente não estiver pronto.</p>
<p>
A stack que vamos usar é Python + Go. Python é o rei do ecossistema de IA, PyTorch, JAX, transformers, datasets, Jupyter, tudo vive aqui. Go é a linguagem pra construir APIs, agentes, servidores MCP e tudo que precisa ser rápido, compilado e deployável com um binário só. Duas linguagens, zero gordura.</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
O ambiente de desenvolvimento
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
Antes de qualquer modelo, antes de qualquer dataset, você precisa de um lugar onde o código <em>roda</em>. Não adianta ter o melhor notebook do mundo se o Python não encontra o NumPy, ou se seu agente em Go não compila.</p>
<p>
O que vamos fazer aqui: instalar Python (com <code>uv</code>) e Go, nessa ordem. O objetivo é chegar no fim com um terminal onde <code>python</code> e <code>go</code> respondem sem erro e você entende <em>por que</em> cada um está ali. Toda stack de engenharia de IA tem camadas. Se uma falha, a culpa cai na de cima e você nunca sabe onde foi o problema:</p>
<div class="src src-mermaid">
<pre tabindex="0"><code class="language-mermaid" data-lang="mermaid">graph TD
    A[&#34;4. Bibliotecas de IA&lt;br/&gt;PyTorch, JAX, transformers, etc.&#34;] --&gt; B[&#34;3. Runtimes de linguagem&lt;br/&gt;Python 3.12+, Go 1.23+&#34;]
    B --&gt; C[&#34;2. Gerenciadores de pacote&lt;br/&gt;uv, go mod&#34;]
    C --&gt; D[&#34;1. Fundação do sistema&lt;br/&gt;OS, shell, git, editor, drivers GPU&#34;]

    classDef l4 fill:#1a1c2e,stroke:#4a4e6b,color:#b8bcd0
    classDef l3 fill:#1e2040,stroke:#525580,color:#c0c4d8
    classDef l2 fill:#222450,stroke:#5a5e90,color:#c8cce0
    classDef l1 fill:#262860,stroke:#6266a0,color:#d0d4e8
    class A l4
    class B l3
    class C l2
    class D l1</code></pre>
</div>
<p>
Em Python, ao menos neste experimento, prefira usar <code>uv</code> ao invés de <code>pip</code> por questão de praticidade e performance:</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl">curl -LsSf https://astral.sh/uv/install.sh <span class="p">|</span> sh
</span></span><span class="line"><span class="cl">uv python install 3.12
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">uv venv
</span></span><span class="line"><span class="cl"><span class="nb">source</span> .venv/bin/activate  <span class="c1"># ou .venv\Scripts\activate no Windows</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">uv pip install numpy matplotlib jupyter</span></span></code></pre></div>
</div>
<p>
Verifique se tudo subiu:</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">sys</span><span class="p">;</span> <span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;Python </span><span class="si">{</span><span class="n">sys</span><span class="o">.</span><span class="n">version</span><span class="si">}</span><span class="s2">&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span><span class="p">;</span> <span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;NumPy </span><span class="si">{</span><span class="n">np</span><span class="o">.</span><span class="n">__version__</span><span class="si">}</span><span class="s2">&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="n">a</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([</span><span class="mi">1</span><span class="p">,</span> <span class="mi">2</span><span class="p">,</span> <span class="mi">3</span><span class="p">])</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;Vector: </span><span class="si">{</span><span class="n">a</span><span class="si">}</span><span class="s2">, dot: </span><span class="si">{</span><span class="n">np</span><span class="o">.</span><span class="n">dot</span><span class="p">(</span><span class="n">a</span><span class="p">,</span> <span class="n">a</span><span class="p">)</span><span class="si">}</span><span class="s2">&#34;</span><span class="p">)</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Go
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>
Python cuida dos modelos. Go cuida de todo o resto: APIs de LLM, agentes autônomos, servidores MCP, ferramentas de linha de comando, automação de infra. É a linguagem que você usa quando precisa de performance, deploy simples e zero dependência externa.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl"><span class="c1"># Linux/macOS</span>
</span></span><span class="line"><span class="cl">curl -sSL https://go.dev/dl/go1.23.4.linux-amd64.tar.gz <span class="p">|</span> sudo tar -C /usr/local -xz
</span></span><span class="line"><span class="cl"><span class="nb">echo</span> <span class="s1">&#39;export PATH=$PATH:/usr/local/go/bin&#39;</span> &gt;&gt; ~/.bashrc
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Windows (PowerShell como admin)</span>
</span></span><span class="line"><span class="cl">winget install GoLang.Go.1.23
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Ou via gvm (gerenciador de versões, similar ao fnm)</span>
</span></span><span class="line"><span class="cl">bash &lt; &lt;<span class="o">(</span>curl -s -S -L https://raw.githubusercontent.com/moovweb/gvm/master/binds/gvm_install<span class="o">)</span>
</span></span><span class="line"><span class="cl"><span class="nb">source</span> ~/.gvm/scripts/gvm
</span></span><span class="line"><span class="cl">gvm install go1.23.4
</span></span><span class="line"><span class="cl">gvm use go1.23.4</span></span></code></pre></div>
</div>
<p>
Verifique:</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl">go version
</span></span><span class="line"><span class="cl"><span class="c1"># go version go1.23.4 linux/amd64</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">mkdir -p ~/hello <span class="o">&amp;&amp;</span> <span class="nb">cd</span> ~/hello
</span></span><span class="line"><span class="cl">go mod init hello
</span></span><span class="line"><span class="cl">cat &gt; main.go <span class="s">&lt;&lt; &#39;EOF&#39;
</span></span></span><span class="line"><span class="cl"><span class="s">package main
</span></span></span><span class="line"><span class="cl"><span class="s">import &#34;fmt&#34;
</span></span></span><span class="line"><span class="cl"><span class="s">func main() { fmt.Println(&#34;Go pronto pra IA.&#34;) }
</span></span></span><span class="line"><span class="cl"><span class="s">EOF</span>
</span></span><span class="line"><span class="cl">go run main.go</span></span></code></pre></div>
</div>
<blockquote>
<p><em>Em miúdos:</em> <code>Go</code> (ou Golang) foi criada pelo Google pra resolver problemas de infraestrutura em escala. Ela compila em segundos, gera um binário estático (sem dependências externas) e tem concorrência nativa com goroutines, perfeito pra agentes que fazem dezenas de chamadas de API em paralelo. <code>MCP</code> (Model Context Protocol) é um protocolo aberto da Anthropic que padroniza como agentes de IA se conectam a ferramentas externas (bancos de dados, APIs, sistemas de arquivos), Go é uma das linguagens mais usadas pra implementar servidores MCP. <code>Go modules</code> (<code>go mod</code>) é o gerenciador de dependências nativo do Go, similar ao <code>uv</code> no Python.</p>
</blockquote>
<blockquote>
<p><em>Saiba mais:</em> se seu terminal diz &#34;command not found&#34; depois de instalar, você provavelmente esqueceu de reiniciar o shell ou rodar o <code>source</code> do profile. Acontece com todo mundo.</p>
</blockquote>
</div>
</div>
