blog/content/post/ai-setup.org
* GPU: local, nuvem ou Colab?

Você já tem Python e Go rodando. Agora a pergunta que define se seu treino vai durar 10 minutos ou 8 horas: /onde está sua GPU?/

O que vamos fazer aqui: verificar se você tem GPU local tanto NVIDIA quanto AMD, aprender a usar o Google Colab como alternativa gratuita, e rodar um benchmark pra ver o speedup real. No fim, você vai saber qual opção usar e como instalar o PyTorch certo pro seu hardware.

Treinar em CPU é ok pra aprender. Treinar pra valer em CPU é dormir 8 horas esperando um /epoch/ (uma passada completa do modelo por todo o dataset de treino se seu dataset tem 50 mil imagens, uma epoch significa que o modelo viu cada uma delas uma vez). GPU acelera isso por um fator de 50 a 200x. Você tem três opções e nenhuma é universalmente melhor:

| Opção | Custo | Setup | Ideal para |
|-------+-------+-------+------------|
| GPU local (NVIDIA ou AMD) | $0 (já é sua) | Instalar driver + PyTorch | Uso diário, datasets grandes |
| Google Colab (T4 grátis) | $0 | Nenhum | Experimentos rápidos, sem GPU em casa |
| Cloud GPU (Lambda, RunPod) | $0.20–2.00/h | SSH + instalação | Treinamento pesado, modelos grandes |

**Se você tem NVIDIA**, verifique com:

#+BEGIN_SRC bash
nvidia-smi
#+END_SRC

Instale o PyTorch com CUDA:

#+BEGIN_SRC bash
uv pip install torch torchvision torchaudio --index-url https://download.pytorch.org/whl/cu124
#+END_SRC

**Se você tem AMD** (como eu), verifique com:

#+BEGIN_SRC bash
rocm-smi
# ou, se não tiver o rocm-smi instalado:
rocminfo | grep -E "Name:|VRAM"
#+END_SRC

Instale o PyTorch com ROCm:

#+BEGIN_SRC bash
uv pip install torch torchvision torchaudio --index-url https://download.pytorch.org/whl/rocm6.0
#+END_SRC

O bonito é que, depois de instalado, o código Python é /idêntico/ pros dois. O PyTorch trata ROCm como um backend CUDA-like, você continua usando ~torch.cuda.is_available()~ e ~model.to("cuda")~, e ele resolve pra você. Não precisa de ~if nvidia elif amd~ no código. E no Python, o teste pra ambos:

#+BEGIN_SRC python
import torch
print(f"GPU disponível: {torch.cuda.is_available()}")
if torch.cuda.is_available():
    print(f"GPU: {torch.cuda.get_device_name(0)}")
    print(f"VRAM: {torch.cuda.get_device_properties(0).total_memory / 1e9:.1f} GB")
#+END_SRC

O benchmark que compara CPU e GPU na multiplicação de matrizes 5000x5000:

#+BEGIN_SRC python
import torch, time
size = 5000
a_cpu = torch.randn(size, size); b_cpu = torch.randn(size, size)

start = time.time()
c_cpu = a_cpu @ b_cpu
print(f"CPU: {time.time() - start:.3f}s")

if torch.cuda.is_available():
    a_gpu = a_cpu.to("cuda"); b_gpu = b_cpu.to("cuda")
    torch.cuda.synchronize()
    start = time.time()
    c_gpu = a_gpu @ b_gpu
    torch.cuda.synchronize()
    print(f"GPU: {time.time() - start:.3f}s")
    print(f"Speedup: {cpu_time / gpu_time:.0f}x")
#+END_SRC

Na primeira vez que eu rodei isso na minha AMD, o speedup foi de 140x. Depois disso você nunca mais quer treinar em CPU.

#+BEGIN_QUOTE
/Em miúdos:/ ~CUDA~ é a plataforma de computação paralela da NVIDIA, é ela que deixa você rodar código na GPU em vez da CPU. ~ROCm~ (Radeon Open Compute) é o equivalente da AMD, mesma ideia, implementação diferente, mesma API no PyTorch. ~cuDNN~ é uma biblioteca otimizada de redes neurais que roda em cima do CUDA. A AMD tem a ~MIOpen~ como equivalente. ~VRAM~ é a memória de vídeo da GPU, aquele número em GB que limita o tamanho do modelo que você consegue treinar. E ~device-agnostic~ é o padrão de código que pergunta "tem GPU?" antes de mandar o modelo pra lá, o ~model.to(device)~ que você vai escrever umas mil vezes.
#+END_QUOTE

*Sem GPU?*

A maioria dos tutoriais e experimentos iniciais roda em CPU. Os mais pesados que precisam de GPU geralmente incluem links pro Colab. O device-agnostic pattern que você vai usar o tempo inteiro:

#+BEGIN_SRC python
device = torch.device("cuda" if torch.cuda.is_available() else "cpu")
model = model.to(device)
#+END_SRC

