ai-setup/index.html
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
GPU: local, nuvem ou Colab?
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>
Você já tem Python e Go rodando. Agora a pergunta que define se seu treino vai durar 10 minutos ou 8 horas: <em>onde está sua GPU?</em></p>
<p>
O que vamos fazer aqui: verificar se você tem GPU local tanto NVIDIA quanto AMD, aprender a usar o Google Colab como alternativa gratuita, e rodar um benchmark pra ver o speedup real. No fim, você vai saber qual opção usar e como instalar o PyTorch certo pro seu hardware.</p>
<p>
Treinar em CPU é ok pra aprender. Treinar pra valer em CPU é dormir 8 horas esperando um <em>epoch</em> (uma passada completa do modelo por todo o dataset de treino se seu dataset tem 50 mil imagens, uma epoch significa que o modelo viu cada uma delas uma vez). GPU acelera isso por um fator de 50 a 200x. Você tem três opções e nenhuma é universalmente melhor:</p>
<table>
<thead>
<tr>
<th>Opção</th>
<th>Custo</th>
<th>Setup</th>
<th>Ideal para</th>
</tr>
</thead>
<tbody>
<tr>
<td>GPU local (NVIDIA ou AMD)</td>
<td>$0 (já é sua)</td>
<td>Instalar driver + PyTorch</td>
<td>Uso diário, datasets grandes</td>
</tr>
<tr>
<td>Google Colab (T4 grátis)</td>
<td>$0</td>
<td>Nenhum</td>
<td>Experimentos rápidos, sem GPU em casa</td>
</tr>
<tr>
<td>Cloud GPU (Lambda, RunPod)</td>
<td>$0.20–2.00/h</td>
<td>SSH + instalação</td>
<td>Treinamento pesado, modelos grandes</td>
</tr>
</tbody>
</table>
<p>
<strong><strong>Se você tem NVIDIA</strong></strong>, verifique com:</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl">nvidia-smi</span></span></code></pre></div>
</div>
<p>
Instale o PyTorch com CUDA:</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl">uv pip install torch torchvision torchaudio --index-url https://download.pytorch.org/whl/cu124</span></span></code></pre></div>
</div>
<p>
<strong><strong>Se você tem AMD</strong></strong> (como eu), verifique com:</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl">rocm-smi
</span></span><span class="line"><span class="cl"><span class="c1"># ou, se não tiver o rocm-smi instalado:</span>
</span></span><span class="line"><span class="cl">rocminfo <span class="p">|</span> grep -E <span class="s2">&#34;Name:|VRAM&#34;</span></span></span></code></pre></div>
</div>
<p>
Instale o PyTorch com ROCm:</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl">uv pip install torch torchvision torchaudio --index-url https://download.pytorch.org/whl/rocm6.0</span></span></code></pre></div>
</div>
<p>
O bonito é que, depois de instalado, o código Python é <em>idêntico</em> pros dois. O PyTorch trata ROCm como um backend CUDA-like, você continua usando <code>torch.cuda.is_available()</code> e <code>model.to(&#34;cuda&#34;)</code>, e ele resolve pra você. Não precisa de <code>if nvidia elif amd</code> no código. E no Python, o teste pra ambos:</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">torch</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;GPU disponível: </span><span class="si">{</span><span class="n">torch</span><span class="o">.</span><span class="n">cuda</span><span class="o">.</span><span class="n">is_available</span><span class="p">()</span><span class="si">}</span><span class="s2">&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="k">if</span> <span class="n">torch</span><span class="o">.</span><span class="n">cuda</span><span class="o">.</span><span class="n">is_available</span><span class="p">():</span>
</span></span><span class="line"><span class="cl">    <span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;GPU: </span><span class="si">{</span><span class="n">torch</span><span class="o">.</span><span class="n">cuda</span><span class="o">.</span><span class="n">get_device_name</span><span class="p">(</span><span class="mi">0</span><span class="p">)</span><span class="si">}</span><span class="s2">&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;VRAM: </span><span class="si">{</span><span class="n">torch</span><span class="o">.</span><span class="n">cuda</span><span class="o">.</span><span class="n">get_device_properties</span><span class="p">(</span><span class="mi">0</span><span class="p">)</span><span class="o">.</span><span class="n">total_memory</span> <span class="o">/</span> <span class="mf">1e9</span><span class="si">:</span><span class="s2">.1f</span><span class="si">}</span><span class="s2"> GB&#34;</span><span class="p">)</span></span></span></code></pre></div>
</div>
<p>
O benchmark que compara CPU e GPU na multiplicação de matrizes 5000x5000:</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">torch</span><span class="o">,</span> <span class="nn">time</span>
</span></span><span class="line"><span class="cl"><span class="n">size</span> <span class="o">=</span> <span class="mi">5000</span>
</span></span><span class="line"><span class="cl"><span class="n">a_cpu</span> <span class="o">=</span> <span class="n">torch</span><span class="o">.</span><span class="n">randn</span><span class="p">(</span><span class="n">size</span><span class="p">,</span> <span class="n">size</span><span class="p">);</span> <span class="n">b_cpu</span> <span class="o">=</span> <span class="n">torch</span><span class="o">.</span><span class="n">randn</span><span class="p">(</span><span class="n">size</span><span class="p">,</span> <span class="n">size</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">start</span> <span class="o">=</span> <span class="n">time</span><span class="o">.</span><span class="n">time</span><span class="p">()</span>
</span></span><span class="line"><span class="cl"><span class="n">c_cpu</span> <span class="o">=</span> <span class="n">a_cpu</span> <span class="o">@</span> <span class="n">b_cpu</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;CPU: </span><span class="si">{</span><span class="n">time</span><span class="o">.</span><span class="n">time</span><span class="p">()</span> <span class="o">-</span> <span class="n">start</span><span class="si">:</span><span class="s2">.3f</span><span class="si">}</span><span class="s2">s&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">if</span> <span class="n">torch</span><span class="o">.</span><span class="n">cuda</span><span class="o">.</span><span class="n">is_available</span><span class="p">():</span>
</span></span><span class="line"><span class="cl">    <span class="n">a_gpu</span> <span class="o">=</span> <span class="n">a_cpu</span><span class="o">.</span><span class="n">to</span><span class="p">(</span><span class="s2">&#34;cuda&#34;</span><span class="p">);</span> <span class="n">b_gpu</span> <span class="o">=</span> <span class="n">b_cpu</span><span class="o">.</span><span class="n">to</span><span class="p">(</span><span class="s2">&#34;cuda&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="n">torch</span><span class="o">.</span><span class="n">cuda</span><span class="o">.</span><span class="n">synchronize</span><span class="p">()</span>
</span></span><span class="line"><span class="cl">    <span class="n">start</span> <span class="o">=</span> <span class="n">time</span><span class="o">.</span><span class="n">time</span><span class="p">()</span>
</span></span><span class="line"><span class="cl">    <span class="n">c_gpu</span> <span class="o">=</span> <span class="n">a_gpu</span> <span class="o">@</span> <span class="n">b_gpu</span>
</span></span><span class="line"><span class="cl">    <span class="n">torch</span><span class="o">.</span><span class="n">cuda</span><span class="o">.</span><span class="n">synchronize</span><span class="p">()</span>
</span></span><span class="line"><span class="cl">    <span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;GPU: </span><span class="si">{</span><span class="n">time</span><span class="o">.</span><span class="n">time</span><span class="p">()</span> <span class="o">-</span> <span class="n">start</span><span class="si">:</span><span class="s2">.3f</span><span class="si">}</span><span class="s2">s&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;Speedup: </span><span class="si">{</span><span class="n">cpu_time</span> <span class="o">/</span> <span class="n">gpu_time</span><span class="si">:</span><span class="s2">.0f</span><span class="si">}</span><span class="s2">x&#34;</span><span class="p">)</span></span></span></code></pre></div>
</div>
<p>
Na primeira vez que eu rodei isso na minha AMD, o speedup foi de 140x. Depois disso você nunca mais quer treinar em CPU.</p>
<blockquote>
<p><em>Em miúdos:</em> <code>CUDA</code> é a plataforma de computação paralela da NVIDIA, é ela que deixa você rodar código na GPU em vez da CPU. <code>ROCm</code> (Radeon Open Compute) é o equivalente da AMD, mesma ideia, implementação diferente, mesma API no PyTorch. <code>cuDNN</code> é uma biblioteca otimizada de redes neurais que roda em cima do CUDA. A AMD tem a <code>MIOpen</code> como equivalente. <code>VRAM</code> é a memória de vídeo da GPU, aquele número em GB que limita o tamanho do modelo que você consegue treinar. E <code>device-agnostic</code> é o padrão de código que pergunta &#34;tem GPU?&#34; antes de mandar o modelo pra lá, o <code>model.to(device)</code> que você vai escrever umas mil vezes.</p>
</blockquote>
<p>
<strong>Sem GPU?</strong></p>
<p>
A maioria dos tutoriais e experimentos iniciais roda em CPU. Os mais pesados que precisam de GPU geralmente incluem links pro Colab. O device-agnostic pattern que você vai usar o tempo inteiro:</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="n">device</span> <span class="o">=</span> <span class="n">torch</span><span class="o">.</span><span class="n">device</span><span class="p">(</span><span class="s2">&#34;cuda&#34;</span> <span class="k">if</span> <span class="n">torch</span><span class="o">.</span><span class="n">cuda</span><span class="o">.</span><span class="n">is_available</span><span class="p">()</span> <span class="k">else</span> <span class="s2">&#34;cpu&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="n">model</span> <span class="o">=</span> <span class="n">model</span><span class="o">.</span><span class="n">to</span><span class="p">(</span><span class="n">device</span><span class="p">)</span></span></span></code></pre></div>
</div>
</div>
</div>
