blog/content/post/ai-setup.org
* APIs e chaves: o padrão que nunca muda

Modelos grandes como GPT e Claude não rodam no seu laptop, eles vivem em servidores, e você conversa com eles via API. É como pedir comida por aplicativo: você faz o pedido (request), o restaurante prepara (processamento) e entrega (response). A chave de API é seu endereço de entrega, sem ela, ninguém sabe quem está pedindo.

O que vamos fazer aqui: guardar chaves com segurança (nunca no código!), fazer a primeira chamada a um LLM usando Python, e entender o que acontece por baixo dos panos quando você usa um SDK. No fim, você vai saber debugar os quatro erros HTTP mais comuns sem precisar do Google.

Quando você começar a trabalhar com LLMs, vai chamar APIs da Anthropic, OpenAI e Google. Mais adiante, quando estiver construindo agentes autônomos, essas chamadas vão acontecer em loop. Toda API funciona do mesmo jeito:

1. Um endpoint (URL)
2. Uma chave (autenticação)
3. Um corpo de requisição (o que você quer)
4. Um corpo de resposta (o que volta)

A primeira chamada, via SDK:

#+BEGIN_SRC python
import anthropic

client = anthropic.Anthropic()
response = client.messages.create(
    model="claude-sonnet-4-20250514",
    max_tokens=256,
    messages=[{"role": "user", "content": "O que é uma rede neural em uma frase?"}]
)
print(response.content[0].text)
#+END_SRC

E a versão HTTP crua, que é o que o SDK faz por baixo e você precisa entender pra debugar:

#+BEGIN_SRC python
import os, urllib.request, json

url = "https://api.anthropic.com/v1/messages"
headers = {
    "Content-Type": "application/json",
    "x-api-key": os.environ["ANTHROPIC_API_KEY"],
    "anthropic-version": "2023-06-01",
}
body = json.dumps({
    "model": "claude-sonnet-4-20250514",
    "max_tokens": 256,
    "messages": [{"role": "user", "content": "O que é uma rede neural em uma frase?"}],
}).encode()

req = urllib.request.Request(url, data=body, headers=headers, method="POST")
with urllib.request.urlopen(req) as resp:
    result = json.loads(resp.read())
    print(result["content"][0]["text"])
#+END_SRC

Regra número um: /nunca/ ponha chave de API no código. Use variáveis de ambiente ou um ~.env~ (que vai pro ~.gitignore~). Regra número dois: leia a mensagem de erro. ~401~ é chave errada, ~429~ é rate limit, ~400~ é corpo malformado. Os erros de API são surpreendentemente informativos quando você para pra ler.

| API | Quando precisa | Crédito grátis |
|-----+---------------+---------------|
| Anthropic (Claude) | Agentes, ferramentas, LLMs | $5 no cadastro |
| OpenAI | Comparação, benchmarks | $5 no cadastro |
| Hugging Face | Modelos, datasets, embeddings | Grátis |

#+BEGIN_QUOTE
/Em miúdos:/ ~LLM~ (Large Language Model) é o modelo de linguagem grande, GPT, Claude, Gemini. ~SDK~ (Software Development Kit) é uma biblioteca pronta que empacota as chamadas HTTP pra você não precisar escrever ~urllib.request~ manualmente. ~Rate limit~ é o limite de requisições por minuto que a API impõe pra evitar abuso; quando você estoura, recebe HTTP 429 e precisa esperar. ~Token~, no contexto de APIs, é a unidade de cobrança: cada palavra (ou pedaço de palavra) que você manda ou recebe conta como token. O ~max_tokens=256~ do código acima significa "não me cobre mais do que 256 tokens de resposta". E ~variável de ambiente~ é aquela configuração que fica fora do código, você define no terminal com ~export~ ou num arquivo ~.env~, e o programa lê de lá. Isso evita que sua chave secreta vá parar no GitHub.
#+END_QUOTE

