ai-setup/index.html
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
APIs e chaves: o padrão que nunca muda
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>
Modelos grandes como GPT e Claude não rodam no seu laptop, eles vivem em servidores, e você conversa com eles via API. É como pedir comida por aplicativo: você faz o pedido (request), o restaurante prepara (processamento) e entrega (response). A chave de API é seu endereço de entrega, sem ela, ninguém sabe quem está pedindo.</p>
<p>
O que vamos fazer aqui: guardar chaves com segurança (nunca no código!), fazer a primeira chamada a um LLM usando Python, e entender o que acontece por baixo dos panos quando você usa um SDK. No fim, você vai saber debugar os quatro erros HTTP mais comuns sem precisar do Google.</p>
<p>
Quando você começar a trabalhar com LLMs, vai chamar APIs da Anthropic, OpenAI e Google. Mais adiante, quando estiver construindo agentes autônomos, essas chamadas vão acontecer em loop. Toda API funciona do mesmo jeito:</p>
<ol>
<li>Um endpoint (URL)</li>
<li>Uma chave (autenticação)</li>
<li>Um corpo de requisição (o que você quer)</li>
<li>Um corpo de resposta (o que volta)</li>
</ol>
<p>A primeira chamada, via SDK:</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">anthropic</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">client</span> <span class="o">=</span> <span class="n">anthropic</span><span class="o">.</span><span class="n">Anthropic</span><span class="p">()</span>
</span></span><span class="line"><span class="cl"><span class="n">response</span> <span class="o">=</span> <span class="n">client</span><span class="o">.</span><span class="n">messages</span><span class="o">.</span><span class="n">create</span><span class="p">(</span>
</span></span><span class="line"><span class="cl">    <span class="n">model</span><span class="o">=</span><span class="s2">&#34;claude-sonnet-4-20250514&#34;</span><span class="p">,</span>
</span></span><span class="line"><span class="cl">    <span class="n">max_tokens</span><span class="o">=</span><span class="mi">256</span><span class="p">,</span>
</span></span><span class="line"><span class="cl">    <span class="n">messages</span><span class="o">=</span><span class="p">[{</span><span class="s2">&#34;role&#34;</span><span class="p">:</span> <span class="s2">&#34;user&#34;</span><span class="p">,</span> <span class="s2">&#34;content&#34;</span><span class="p">:</span> <span class="s2">&#34;O que é uma rede neural em uma frase?&#34;</span><span class="p">}]</span>
</span></span><span class="line"><span class="cl"><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="n">response</span><span class="o">.</span><span class="n">content</span><span class="p">[</span><span class="mi">0</span><span class="p">]</span><span class="o">.</span><span class="n">text</span><span class="p">)</span></span></span></code></pre></div>
</div>
<p>
E a versão HTTP crua, que é o que o SDK faz por baixo e você precisa entender pra debugar:</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">os</span><span class="o">,</span> <span class="nn">urllib.request</span><span class="o">,</span> <span class="nn">json</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">url</span> <span class="o">=</span> <span class="s2">&#34;https://api.anthropic.com/v1/messages&#34;</span>
</span></span><span class="line"><span class="cl"><span class="n">headers</span> <span class="o">=</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl">    <span class="s2">&#34;Content-Type&#34;</span><span class="p">:</span> <span class="s2">&#34;application/json&#34;</span><span class="p">,</span>
</span></span><span class="line"><span class="cl">    <span class="s2">&#34;x-api-key&#34;</span><span class="p">:</span> <span class="n">os</span><span class="o">.</span><span class="n">environ</span><span class="p">[</span><span class="s2">&#34;ANTHROPIC_API_KEY&#34;</span><span class="p">],</span>
</span></span><span class="line"><span class="cl">    <span class="s2">&#34;anthropic-version&#34;</span><span class="p">:</span> <span class="s2">&#34;2023-06-01&#34;</span><span class="p">,</span>
</span></span><span class="line"><span class="cl"><span class="p">}</span>
</span></span><span class="line"><span class="cl"><span class="n">body</span> <span class="o">=</span> <span class="n">json</span><span class="o">.</span><span class="n">dumps</span><span class="p">({</span>
</span></span><span class="line"><span class="cl">    <span class="s2">&#34;model&#34;</span><span class="p">:</span> <span class="s2">&#34;claude-sonnet-4-20250514&#34;</span><span class="p">,</span>
</span></span><span class="line"><span class="cl">    <span class="s2">&#34;max_tokens&#34;</span><span class="p">:</span> <span class="mi">256</span><span class="p">,</span>
</span></span><span class="line"><span class="cl">    <span class="s2">&#34;messages&#34;</span><span class="p">:</span> <span class="p">[{</span><span class="s2">&#34;role&#34;</span><span class="p">:</span> <span class="s2">&#34;user&#34;</span><span class="p">,</span> <span class="s2">&#34;content&#34;</span><span class="p">:</span> <span class="s2">&#34;O que é uma rede neural em uma frase?&#34;</span><span class="p">}],</span>
</span></span><span class="line"><span class="cl"><span class="p">})</span><span class="o">.</span><span class="n">encode</span><span class="p">()</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">req</span> <span class="o">=</span> <span class="n">urllib</span><span class="o">.</span><span class="n">request</span><span class="o">.</span><span class="n">Request</span><span class="p">(</span><span class="n">url</span><span class="p">,</span> <span class="n">data</span><span class="o">=</span><span class="n">body</span><span class="p">,</span> <span class="n">headers</span><span class="o">=</span><span class="n">headers</span><span class="p">,</span> <span class="n">method</span><span class="o">=</span><span class="s2">&#34;POST&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="k">with</span> <span class="n">urllib</span><span class="o">.</span><span class="n">request</span><span class="o">.</span><span class="n">urlopen</span><span class="p">(</span><span class="n">req</span><span class="p">)</span> <span class="k">as</span> <span class="n">resp</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">    <span class="n">result</span> <span class="o">=</span> <span class="n">json</span><span class="o">.</span><span class="n">loads</span><span class="p">(</span><span class="n">resp</span><span class="o">.</span><span class="n">read</span><span class="p">())</span>
</span></span><span class="line"><span class="cl">    <span class="nb">print</span><span class="p">(</span><span class="n">result</span><span class="p">[</span><span class="s2">&#34;content&#34;</span><span class="p">][</span><span class="mi">0</span><span class="p">][</span><span class="s2">&#34;text&#34;</span><span class="p">])</span></span></span></code></pre></div>
</div>
<p>
Regra número um: <em>nunca</em> ponha chave de API no código. Use variáveis de ambiente ou um <code>.env</code> (que vai pro <code>.gitignore</code>). Regra número dois: leia a mensagem de erro. <code>401</code> é chave errada, <code>429</code> é rate limit, <code>400</code> é corpo malformado. Os erros de API são surpreendentemente informativos quando você para pra ler.</p>
<table>
<thead>
<tr>
<th>API</th>
<th>Quando precisa</th>
<th>Crédito grátis</th>
</tr>
</thead>
<tbody>
<tr>
<td>Anthropic (Claude)</td>
<td>Agentes, ferramentas, LLMs</td>
<td>$5 no cadastro</td>
</tr>
<tr>
<td>OpenAI</td>
<td>Comparação, benchmarks</td>
<td>$5 no cadastro</td>
</tr>
<tr>
<td>Hugging Face</td>
<td>Modelos, datasets, embeddings</td>
<td>Grátis</td>
</tr>
</tbody>
</table>
<blockquote>
<p><em>Em miúdos:</em> <code>LLM</code> (Large Language Model) é o modelo de linguagem grande, GPT, Claude, Gemini. <code>SDK</code> (Software Development Kit) é uma biblioteca pronta que empacota as chamadas HTTP pra você não precisar escrever <code>urllib.request</code> manualmente. <code>Rate limit</code> é o limite de requisições por minuto que a API impõe pra evitar abuso; quando você estoura, recebe HTTP 429 e precisa esperar. <code>Token</code>, no contexto de APIs, é a unidade de cobrança: cada palavra (ou pedaço de palavra) que você manda ou recebe conta como token. O <code>max_tokens=256</code> do código acima significa &#34;não me cobre mais do que 256 tokens de resposta&#34;. E <code>variável de ambiente</code> é aquela configuração que fica fora do código, você define no terminal com <code>export</code> ou num arquivo <code>.env</code>, e o programa lê de lá. Isso evita que sua chave secreta vá parar no GitHub.</p>
</blockquote>
</div>
</div>
