blog/content/post/ai-setup.org
* Jupyter: o laboratório de IA

Toda competição do Kaggle, todo paper com código, todo tutorial de fine-tuning usa Jupyter. Não é frescura, é que notebook deixa você rodar código em pedaços, ver output inline e iterar sem rerodar o script inteiro.

Mas notebook também é uma arma carregada. Os três tiros no pé mais comuns:

- /Execução fora de ordem./ Você roda célula 5, depois a 2, depois a 7. Funciona na sua máquina. Quebra quando alguém roda de cima pra baixo. Corrige com ~Kernel > Restart & Run All~.
- /Estado fantasma./ Você deleta uma célula, mas a variável que ela criou continua na memória. O notebook parece limpo, mas depende de um fantasma. Reinicie o kernel regularmente.
- /Vazamento de memória./ Você carrega um dataset de 4 GB, treina um modelo, carrega outro dataset. Nada é liberado. ~del variavel~ e ~gc.collect()~, ou reinicie o kernel.

Os magic commands que salvam tempo:

#+BEGIN_SRC python
%timeit np.random.randn(10000)       # microbenchmark (roda N vezes e faz média)
%%time                                # mede a célula inteira (uma vez)
model.fit(X_train, y_train, epochs=10)

%matplotlib inline                    # plots renderizam direto no notebook
!pip install scikit-learn             # shell command sem sair do notebook
%env CUDA_VISIBLE_DEVICES             # checa variável de ambiente
#+END_SRC

A regra de ouro: /explore em notebooks, envie em scripts/. Prototipe no ~.ipynb~, depois extraia o que funciona pra um ~.py~ e importe de volta.

#+BEGIN_QUOTE
/Em miúdos:/ ~Kernel~ é o processo Python que roda por trás do notebook, é ele que executa suas células e mantém as variáveis em memória. Toda vez que você reinicia o kernel, perde as variáveis e precisa rerodar as células. ~Magic commands~ são comandos especiais do Jupyter que começam com ~%~ (linha) ou ~%%~ (célula inteira), eles não são Python, são atalhos do ambiente. ~%timeit~ mede performance rodando o código várias vezes, ~%%time~ mede uma vez só, ~%matplotlib inline~ faz gráficos aparecerem dentro do notebook. E ~!pip install~ é um escape pro shell: o ~!~ manda o comando pro terminal sem sair do notebook. ~.ipynb~ é o formato de arquivo do Jupyter, um JSON que contém as células, os outputs e os metadados.
#+END_QUOTE

#+BEGIN_QUOTE
/Saiba mais:/ o Colab é um Jupyter grátis na nuvem com GPU T4. Vai em [[https://colab.research.google.com][colab.research.google.com]], Runtime > Change runtime type > T4 GPU. Sessões expiram depois de 90 minutos de inatividade no tier gratuito. Monte o Google Drive pra persistência: ~from google.colab import drive; drive.mount('/content/drive')~.
#+END_QUOTE

* Ambientes Python: o fim do dependency hell

Você instala PyTorch 2.4 pra um projeto de fine-tuning. Semana seguinte, outro projeto precisa de PyTorch 2.1 porque o build CUDA é pinado. Você faz upgrade global. O primeiro projeto quebra. Você faz downgrade. O segundo quebra.

Isso se chama /dependency hell/ e é endêmico em IA porque PyTorch, JAX e TensorFlow cada um embarca seus próprios bindings CUDA. A cura: cada projeto no seu próprio ambiente isolado.

#+BEGIN_SRC mermaid
graph TD
    subgraph sem["Sem virtualenv"]
        SP[System Python] --> T24["torch 2.4 (CUDA 12.4)"]
        SP --> T21["torch 2.1 (CUDA 11.8)"]
        SP --> CONFLITO["CONFLITO: só uma versão pode existir"]
    end
    subgraph com["Com virtualenv"]
        PA["Projeto A (.venv/)"] --> P1["torch 2.4 (CUDA 12.4)"]
        PB["Projeto B (.venv/)"] --> P2["torch 2.1 (CUDA 11.8)"]
    end

    classDef base fill:#1e1e30,stroke:#4a4e6b,color:#b8bcd0
    classDef dep fill:#222240,stroke:#525580,color:#c0c4d8
    classDef conflict fill:#301a1f,stroke:#8b4a5a,color:#e0b8c0
    classDef good fill:#1a2a22,stroke:#4a7a5a,color:#b8d8c0
    class SP,PA,PB base
    class T24,T21,P1,P2 dep
    class CONFLITO conflict
#+END_SRC

Três opções, uma recomendação:

| Ferramenta | Quando usar |
|------------+------------|
| ~uv venv~ (recomendado) | Sempre. 10-100x mais rápido que pip. |
| ~venv~ (built-in) | Quando não pode instalar nada. Vem com Python. |
| ~conda~ | Quando precisa de CUDA toolkit específico sem instalar no sistema. |

Uma regra: se você usa conda, use /só/ conda pra todos os pacotes daquele ambiente. Misturar ~pip install~ dentro de conda é receita pra conflito.

O ~pyproject.toml~ substitui ~setup.py~, ~setup.cfg~ e ~requirements.txt~ em um arquivo só:

#+BEGIN_SRC toml
[project]
name = "meu-projeto-ia"
version = "0.1.0"
requires-python = ">=3.11"
dependencies = ["numpy>=1.26", "matplotlib>=3.8", "scikit-learn>=1.4"]

[project.optional-dependencies]
torch = ["torch>=2.3", "torchvision>=0.18"]
llm = ["anthropic>=0.39", "openai>=1.50"]
#+END_SRC

E o lockfile (~uv.lock~ ou ~requirements.lock~) garante que todo mundo que clonar o repositório instale exatamente as mesmas versões. Comite o lockfile. Não comite o ~.venv/~ (200 MB a 2 GB de arquivos não-portáteis).

#+BEGIN_QUOTE
/Em miúdos:/ ~Dependency hell~ ("inferno de dependências") é quando dois projetos precisam de versões diferentes da mesma biblioteca e você só pode ter uma instalada no sistema. O virtualenv resolve isso dando a cada projeto sua própria cópia isolada do Python e das bibliotecas. ~Lockfile~ é o arquivo que congela todas as versões exatas (incluindo dependências das dependências) pra garantir que daqui a seis meses, quando você clonar o projeto de novo, vai instalar exatamente as mesmas versões de tudo. ~Bindings CUDA~ são a ponte entre o PyTorch e o CUDA: cada versão do PyTorch é compilada contra uma versão específica do CUDA (11.8, 12.1, 12.4...), e se você instalar o PyTorch errado pra sua GPU, o ~torch.cuda.is_available()~ volta ~False~ e você treina em CPU sem saber por quê.
#+END_QUOTE

