ai-setup/index.html
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
Jupyter: o laboratório de IA
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>
Toda competição do Kaggle, todo paper com código, todo tutorial de fine-tuning usa Jupyter. Não é frescura, é que notebook deixa você rodar código em pedaços, ver output inline e iterar sem rerodar o script inteiro.</p>
<p>
Mas notebook também é uma arma carregada. Os três tiros no pé mais comuns:</p>
<ul>
<li><em>Execução fora de ordem.</em> Você roda célula 5, depois a 2, depois a 7. Funciona na sua máquina. Quebra quando alguém roda de cima pra baixo. Corrige com <code>Kernel &gt; Restart &amp; Run All</code>.</li>
<li><em>Estado fantasma.</em> Você deleta uma célula, mas a variável que ela criou continua na memória. O notebook parece limpo, mas depende de um fantasma. Reinicie o kernel regularmente.</li>
<li><em>Vazamento de memória.</em> Você carrega um dataset de 4 GB, treina um modelo, carrega outro dataset. Nada é liberado. <code>del variavel</code> e <code>gc.collect()</code>, ou reinicie o kernel.</li>
</ul>
<p>Os magic commands que salvam tempo:</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="o">%</span><span class="n">timeit</span> <span class="n">np</span><span class="o">.</span><span class="n">random</span><span class="o">.</span><span class="n">randn</span><span class="p">(</span><span class="mi">10000</span><span class="p">)</span>       <span class="c1"># microbenchmark (roda N vezes e faz média)</span>
</span></span><span class="line"><span class="cl"><span class="o">%%</span><span class="n">time</span>                                <span class="c1"># mede a célula inteira (uma vez)</span>
</span></span><span class="line"><span class="cl"><span class="n">model</span><span class="o">.</span><span class="n">fit</span><span class="p">(</span><span class="n">X_train</span><span class="p">,</span> <span class="n">y_train</span><span class="p">,</span> <span class="n">epochs</span><span class="o">=</span><span class="mi">10</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="o">%</span><span class="n">matplotlib</span> <span class="n">inline</span>                    <span class="c1"># plots renderizam direto no notebook</span>
</span></span><span class="line"><span class="cl"><span class="err">!</span><span class="n">pip</span> <span class="n">install</span> <span class="n">scikit</span><span class="o">-</span><span class="n">learn</span>             <span class="c1"># shell command sem sair do notebook</span>
</span></span><span class="line"><span class="cl"><span class="o">%</span><span class="n">env</span> <span class="n">CUDA_VISIBLE_DEVICES</span>             <span class="c1"># checa variável de ambiente</span></span></span></code></pre></div>
</div>
<p>
A regra de ouro: <em>explore em notebooks, envie em scripts</em>. Prototipe no <code>.ipynb</code>, depois extraia o que funciona pra um <code>.py</code> e importe de volta.</p>
<blockquote>
<p><em>Em miúdos:</em> <code>Kernel</code> é o processo Python que roda por trás do notebook, é ele que executa suas células e mantém as variáveis em memória. Toda vez que você reinicia o kernel, perde as variáveis e precisa rerodar as células. <code>Magic commands</code> são comandos especiais do Jupyter que começam com <code>%</code> (linha) ou <code>%%</code> (célula inteira), eles não são Python, são atalhos do ambiente. <code>%timeit</code> mede performance rodando o código várias vezes, <code>%%time</code> mede uma vez só, <code>%matplotlib inline</code> faz gráficos aparecerem dentro do notebook. E <code>!pip install</code> é um escape pro shell: o <code>!</code> manda o comando pro terminal sem sair do notebook. <code>.ipynb</code> é o formato de arquivo do Jupyter, um JSON que contém as células, os outputs e os metadados.</p>
</blockquote>
<blockquote>
<p><em>Saiba mais:</em> o Colab é um Jupyter grátis na nuvem com GPU T4. Vai em <a href="https://colab.research.google.com">colab.research.google.com</a>, Runtime &gt; Change runtime type &gt; T4 GPU. Sessões expiram depois de 90 minutos de inatividade no tier gratuito. Monte o Google Drive pra persistência: <code>from google.colab import drive; drive.mount(&#39;/content/drive&#39;)</code>.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
Ambientes Python: o fim do dependency hell
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>
Você instala PyTorch 2.4 pra um projeto de fine-tuning. Semana seguinte, outro projeto precisa de PyTorch 2.1 porque o build CUDA é pinado. Você faz upgrade global. O primeiro projeto quebra. Você faz downgrade. O segundo quebra.</p>
<p>
Isso se chama <em>dependency hell</em> e é endêmico em IA porque PyTorch, JAX e TensorFlow cada um embarca seus próprios bindings CUDA. A cura: cada projeto no seu próprio ambiente isolado.</p>
<div class="src src-mermaid">
<pre tabindex="0"><code class="language-mermaid" data-lang="mermaid">graph TD
    subgraph sem[&#34;Sem virtualenv&#34;]
        SP[System Python] --&gt; T24[&#34;torch 2.4 (CUDA 12.4)&#34;]
        SP --&gt; T21[&#34;torch 2.1 (CUDA 11.8)&#34;]
        SP --&gt; CONFLITO[&#34;CONFLITO: só uma versão pode existir&#34;]
    end
    subgraph com[&#34;Com virtualenv&#34;]
        PA[&#34;Projeto A (.venv/)&#34;] --&gt; P1[&#34;torch 2.4 (CUDA 12.4)&#34;]
        PB[&#34;Projeto B (.venv/)&#34;] --&gt; P2[&#34;torch 2.1 (CUDA 11.8)&#34;]
    end

    classDef base fill:#1e1e30,stroke:#4a4e6b,color:#b8bcd0
    classDef dep fill:#222240,stroke:#525580,color:#c0c4d8
    classDef conflict fill:#301a1f,stroke:#8b4a5a,color:#e0b8c0
    classDef good fill:#1a2a22,stroke:#4a7a5a,color:#b8d8c0
    class SP,PA,PB base
    class T24,T21,P1,P2 dep
    class CONFLITO conflict</code></pre>
</div>
<p>
Três opções, uma recomendação:</p>
<table>
<thead>
<tr>
<th>Ferramenta</th>
<th>Quando usar</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>uv venv</code> (recomendado)</td>
<td>Sempre. 10-100x mais rápido que pip.</td>
</tr>
<tr>
<td><code>venv</code> (built-in)</td>
<td>Quando não pode instalar nada. Vem com Python.</td>
</tr>
<tr>
<td><code>conda</code></td>
<td>Quando precisa de CUDA toolkit específico sem instalar no sistema.</td>
</tr>
</tbody>
</table>
<p>
Uma regra: se você usa conda, use <em>só</em> conda pra todos os pacotes daquele ambiente. Misturar <code>pip install</code> dentro de conda é receita pra conflito.</p>
<p>
O <code>pyproject.toml</code> substitui <code>setup.py</code>, <code>setup.cfg</code> e <code>requirements.txt</code> em um arquivo só:</p>
<div class="src src-toml">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-toml" data-lang="toml"><span class="line"><span class="cl"><span class="p">[</span><span class="nx">project</span><span class="p">]</span>
</span></span><span class="line"><span class="cl"><span class="nx">name</span> <span class="p">=</span> <span class="s2">&#34;meu-projeto-ia&#34;</span>
</span></span><span class="line"><span class="cl"><span class="nx">version</span> <span class="p">=</span> <span class="s2">&#34;0.1.0&#34;</span>
</span></span><span class="line"><span class="cl"><span class="nx">requires-python</span> <span class="p">=</span> <span class="s2">&#34;&gt;=3.11&#34;</span>
</span></span><span class="line"><span class="cl"><span class="nx">dependencies</span> <span class="p">=</span> <span class="p">[</span><span class="s2">&#34;numpy&gt;=1.26&#34;</span><span class="p">,</span> <span class="s2">&#34;matplotlib&gt;=3.8&#34;</span><span class="p">,</span> <span class="s2">&#34;scikit-learn&gt;=1.4&#34;</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="p">[</span><span class="nx">project</span><span class="p">.</span><span class="nx">optional-dependencies</span><span class="p">]</span>
</span></span><span class="line"><span class="cl"><span class="nx">torch</span> <span class="p">=</span> <span class="p">[</span><span class="s2">&#34;torch&gt;=2.3&#34;</span><span class="p">,</span> <span class="s2">&#34;torchvision&gt;=0.18&#34;</span><span class="p">]</span>
</span></span><span class="line"><span class="cl"><span class="nx">llm</span> <span class="p">=</span> <span class="p">[</span><span class="s2">&#34;anthropic&gt;=0.39&#34;</span><span class="p">,</span> <span class="s2">&#34;openai&gt;=1.50&#34;</span><span class="p">]</span></span></span></code></pre></div>
</div>
<p>
E o lockfile (<code>uv.lock</code> ou <code>requirements.lock</code>) garante que todo mundo que clonar o repositório instale exatamente as mesmas versões. Comite o lockfile. Não comite o <code>.venv/</code> (200 MB a 2 GB de arquivos não-portáteis).</p>
<blockquote>
<p><em>Em miúdos:</em> <code>Dependency hell</code> (&#34;inferno de dependências&#34;) é quando dois projetos precisam de versões diferentes da mesma biblioteca e você só pode ter uma instalada no sistema. O virtualenv resolve isso dando a cada projeto sua própria cópia isolada do Python e das bibliotecas. <code>Lockfile</code> é o arquivo que congela todas as versões exatas (incluindo dependências das dependências) pra garantir que daqui a seis meses, quando você clonar o projeto de novo, vai instalar exatamente as mesmas versões de tudo. <code>Bindings CUDA</code> são a ponte entre o PyTorch e o CUDA: cada versão do PyTorch é compilada contra uma versão específica do CUDA (11.8, 12.1, 12.4…), e se você instalar o PyTorch errado pra sua GPU, o <code>torch.cuda.is_available()</code> volta <code>False</code> e você treina em CPU sem saber por quê.</p>
</blockquote>
</div>
</div>
