blog/content/post/ai-setup.org
* Docker: "na minha máquina funciona"

Você treinou um modelo no seu laptop com PyTorch 2.3, CUDA 12.4 e Python 3.12. Seu colega tem PyTorch 2.1, CUDA 11.8 e Python 3.10. O modelo quebra na máquina dele. O Dockerfile funciona nas duas.

Projetos de IA são pesadelos de dependência. Uma stack típica inclui Python, PyTorch, drivers CUDA, cuDNN, bibliotecas C de sistema e pacotes especializados como ~flash-attn~ que exigem versões exatas de compilador. Docker empacota tudo isso numa imagem que roda idêntica em qualquer lugar.

O Dockerfile mínimo pra desenvolvimento com GPU:

#+BEGIN_SRC dockerfile
FROM nvidia/cuda:12.4.1-devel-ubuntu22.04

ENV DEBIAN_FRONTEND=noninteractive
ENV PYTHONUNBUFFERED=1

RUN apt-get update && apt-get install -y --no-install-recommends \
    python3.12 python3.12-venv python3.12-dev python3-pip \
    git curl build-essential \
    && rm -rf /var/lib/apt/lists/*

RUN python -m pip install --no-cache-dir \
    torch torchvision torchaudio \
    --index-url https://download.pytorch.org/whl/cu124

RUN python -m pip install --no-cache-dir \
    numpy pandas scikit-learn matplotlib jupyter transformers datasets

WORKDIR /workspace
VOLUME ["/workspace", "/models"]
#+END_SRC

Builda e roda (NVIDIA):

#+BEGIN_SRC bash
docker build -t ai-dev .
docker run --rm -it --gpus all \
    -v $(pwd):/workspace \
    -v ~/models:/models \
    ai-dev python -c "import torch; print(torch.cuda.is_available())"
#+END_SRC

E pra AMD com ROCm (o ~--device~ expõe a GPU sem precisar do NVIDIA Container Toolkit):

#+BEGIN_SRC bash
docker build -t ai-dev-amd -f- . <<'EOF'
FROM ubuntu:22.04
ENV DEBIAN_FRONTEND=noninteractive
RUN apt-get update && apt-get install -y --no-install-recommends \
    python3.12 python3.12-venv python3.12-dev python3-pip git curl \
    && rm -rf /var/lib/apt/lists/*
RUN python3 -m pip install --no-cache-dir \
    torch torchvision torchaudio \
    --index-url https://download.pytorch.org/whl/rocm6.0
WORKDIR /workspace
VOLUME ["/workspace", "/models"]
EOF

docker run --rm -it \
    --device=/dev/kfd --device=/dev/dri \
    -v $(pwd):/workspace \
    -v ~/models:/models \
    ai-dev-amd python -c "import torch; print(torch.cuda.is_available())"
#+END_SRC

Os volumes são críticos. Seus modelos de 14 GB não podem viver dentro do container, eles morrem junto com ele. Monte um diretório do host e carregue de lá:

#+BEGIN_SRC python
from transformers import AutoModel
model = AutoModel.from_pretrained("/models/llama-7b")
#+END_SRC

Três padrões de container que você vai encontrar:

| Container | Tamanho | Quando usar |
|-----------+---------+------------|
| Dev | Grande (toolkit completo, Jupyter) | Desenvolvimento e experimentação |
| Training | Médio (só o script e dependências) | Cluster GPU, sem editor |
| Inference | Pequeno (otimizado pra servir) | Produção, atrás de load balancer |

E o Docker Compose pra aplicações multi-serviço. Pra NVIDIA:

#+BEGIN_SRC yaml
services:
  ai-dev:
    build: .
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              count: all
              capabilities: [gpu]
    volumes:
      - .:/workspace
      - ~/models:/models
    ports:
      - "8888:8888"

  qdrant:
    image: qdrant/qdrant:v1.12.5
    ports:
      - "6333:6333"
    volumes:
      - qdrant_data:/qdrant/storage

volumes:
  qdrant_data:
#+END_SRC

Pra AMD, troque o bloco ~deploy~ por:

#+BEGIN_SRC yaml
    devices:
      - /dev/kfd:/dev/kfd
      - /dev/dri:/dev/dri
#+END_SRC

Um ~docker compose up -d~ e seu container de IA enxerga o banco vetorial em ~http://qdrant:6333~ pelo nome do serviço. Rede compartilhada, automática, sem configurar IP.

#+BEGIN_QUOTE
/Em miúdos:/ ~Container~ é como uma máquina virtual leve: ele isola seu código, runtime, bibliotecas e ferramentas de sistema num pacote que roda idêntico em qualquer lugar, mas compartilha o kernel do sistema operacional, por isso ele inicia em segundos, não em minutos. ~Imagem~ é o molde (construído a partir de um Dockerfile); ~container~ é a instância rodando da imagem. ~Volume~ é um diretório do seu computador real montado dentro do container, essencial pra modelos de 14 GB que você não quer perder quando o container morrer. ~Inferência~ é o ato de usar um modelo já treinado pra fazer predições (vs ~treinamento~, que é ensinar o modelo). ~flash-attn~ e ~bitsandbytes~ são bibliotecas que otimizam atenção (o mecanismo central dos transformers) e quantização (reduzir precisão dos pesos pra caber em menos memória). ~Vector database~ como o Qdrant armazena embeddings, representações numéricas de texto, pra buscas por similaridade, o coração do RAG. E pra GPU: NVIDIA usa ~--gpus all~ com o NVIDIA Container Toolkit; AMD usa ~--device=/dev/kfd --device=/dev/dri~ pra expor a GPU via ROCm.
#+END_QUOTE

