ai-setup/index.html
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
Docker: &#34;na minha máquina funciona&#34;
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>
Você treinou um modelo no seu laptop com PyTorch 2.3, CUDA 12.4 e Python 3.12. Seu colega tem PyTorch 2.1, CUDA 11.8 e Python 3.10. O modelo quebra na máquina dele. O Dockerfile funciona nas duas.</p>
<p>
Projetos de IA são pesadelos de dependência. Uma stack típica inclui Python, PyTorch, drivers CUDA, cuDNN, bibliotecas C de sistema e pacotes especializados como <code>flash-attn</code> que exigem versões exatas de compilador. Docker empacota tudo isso numa imagem que roda idêntica em qualquer lugar.</p>
<p>
O Dockerfile mínimo pra desenvolvimento com GPU:</p>
<div class="src src-dockerfile">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-dockerfile" data-lang="dockerfile"><span class="line"><span class="cl"><span class="k">FROM</span><span class="w"> </span><span class="s">nvidia/cuda:12.4.1-devel-ubuntu22.04</span><span class="err">
</span></span></span><span class="line"><span class="cl"><span class="err">
</span></span></span><span class="line"><span class="cl"><span class="k">ENV</span> <span class="nv">DEBIAN_FRONTEND</span><span class="o">=</span>noninteractive
</span></span><span class="line"><span class="cl"><span class="k">ENV</span> <span class="nv">PYTHONUNBUFFERED</span><span class="o">=</span><span class="m">1</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">RUN</span> apt-get update <span class="o">&amp;&amp;</span> apt-get install -y --no-install-recommends <span class="se">\
</span></span></span><span class="line"><span class="cl">    python3.12 python3.12-venv python3.12-dev python3-pip <span class="se">\
</span></span></span><span class="line"><span class="cl">    git curl build-essential <span class="se">\
</span></span></span><span class="line"><span class="cl">    <span class="o">&amp;&amp;</span> rm -rf /var/lib/apt/lists/*<span class="err">
</span></span></span><span class="line"><span class="cl"><span class="err">
</span></span></span><span class="line"><span class="cl"><span class="k">RUN</span> python -m pip install --no-cache-dir <span class="se">\
</span></span></span><span class="line"><span class="cl">    torch torchvision torchaudio <span class="se">\
</span></span></span><span class="line"><span class="cl">    --index-url https://download.pytorch.org/whl/cu124<span class="err">
</span></span></span><span class="line"><span class="cl"><span class="err">
</span></span></span><span class="line"><span class="cl"><span class="k">RUN</span> python -m pip install --no-cache-dir <span class="se">\
</span></span></span><span class="line"><span class="cl">    numpy pandas scikit-learn matplotlib jupyter transformers datasets<span class="err">
</span></span></span><span class="line"><span class="cl"><span class="err">
</span></span></span><span class="line"><span class="cl"><span class="k">WORKDIR</span><span class="w"> </span><span class="s">/workspace</span><span class="err">
</span></span></span><span class="line"><span class="cl"><span class="k">VOLUME</span> <span class="p">[</span><span class="s2">&#34;/workspace&#34;</span><span class="p">,</span> <span class="s2">&#34;/models&#34;</span><span class="p">]</span></span></span></code></pre></div>
</div>
<p>
Builda e roda (NVIDIA):</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl">docker build -t ai-dev .
</span></span><span class="line"><span class="cl">docker run --rm -it --gpus all <span class="se">\
</span></span></span><span class="line"><span class="cl">    -v <span class="k">$(</span><span class="nb">pwd</span><span class="k">)</span>:/workspace <span class="se">\
</span></span></span><span class="line"><span class="cl">    -v ~/models:/models <span class="se">\
</span></span></span><span class="line"><span class="cl">    ai-dev python -c <span class="s2">&#34;import torch; print(torch.cuda.is_available())&#34;</span></span></span></code></pre></div>
</div>
<p>
E pra AMD com ROCm (o <code>--device</code> expõe a GPU sem precisar do NVIDIA Container Toolkit):</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl">docker build -t ai-dev-amd -f- . <span class="s">&lt;&lt;&#39;EOF&#39;
</span></span></span><span class="line"><span class="cl"><span class="s">FROM ubuntu:22.04
</span></span></span><span class="line"><span class="cl"><span class="s">ENV DEBIAN_FRONTEND=noninteractive
</span></span></span><span class="line"><span class="cl"><span class="s">RUN apt-get update &amp;&amp; apt-get install -y --no-install-recommends \
</span></span></span><span class="line"><span class="cl"><span class="s">    python3.12 python3.12-venv python3.12-dev python3-pip git curl \
</span></span></span><span class="line"><span class="cl"><span class="s">    &amp;&amp; rm -rf /var/lib/apt/lists/*
</span></span></span><span class="line"><span class="cl"><span class="s">RUN python3 -m pip install --no-cache-dir \
</span></span></span><span class="line"><span class="cl"><span class="s">    torch torchvision torchaudio \
</span></span></span><span class="line"><span class="cl"><span class="s">    --index-url https://download.pytorch.org/whl/rocm6.0
</span></span></span><span class="line"><span class="cl"><span class="s">WORKDIR /workspace
</span></span></span><span class="line"><span class="cl"><span class="s">VOLUME [&#34;/workspace&#34;, &#34;/models&#34;]
</span></span></span><span class="line"><span class="cl"><span class="s">EOF</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">docker run --rm -it <span class="se">\
</span></span></span><span class="line"><span class="cl">    --device<span class="o">=</span>/dev/kfd --device<span class="o">=</span>/dev/dri <span class="se">\
</span></span></span><span class="line"><span class="cl">    -v <span class="k">$(</span><span class="nb">pwd</span><span class="k">)</span>:/workspace <span class="se">\
</span></span></span><span class="line"><span class="cl">    -v ~/models:/models <span class="se">\
</span></span></span><span class="line"><span class="cl">    ai-dev-amd python -c <span class="s2">&#34;import torch; print(torch.cuda.is_available())&#34;</span></span></span></code></pre></div>
</div>
<p>
Os volumes são críticos. Seus modelos de 14 GB não podem viver dentro do container, eles morrem junto com ele. Monte um diretório do host e carregue de lá:</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">from</span> <span class="nn">transformers</span> <span class="kn">import</span> <span class="n">AutoModel</span>
</span></span><span class="line"><span class="cl"><span class="n">model</span> <span class="o">=</span> <span class="n">AutoModel</span><span class="o">.</span><span class="n">from_pretrained</span><span class="p">(</span><span class="s2">&#34;/models/llama-7b&#34;</span><span class="p">)</span></span></span></code></pre></div>
</div>
<p>
Três padrões de container que você vai encontrar:</p>
<table>
<thead>
<tr>
<th>Container</th>
<th>Tamanho</th>
<th>Quando usar</th>
</tr>
</thead>
<tbody>
<tr>
<td>Dev</td>
<td>Grande (toolkit completo, Jupyter)</td>
<td>Desenvolvimento e experimentação</td>
</tr>
<tr>
<td>Training</td>
<td>Médio (só o script e dependências)</td>
<td>Cluster GPU, sem editor</td>
</tr>
<tr>
<td>Inference</td>
<td>Pequeno (otimizado pra servir)</td>
<td>Produção, atrás de load balancer</td>
</tr>
</tbody>
</table>
<p>
E o Docker Compose pra aplicações multi-serviço. Pra NVIDIA:</p>
<div class="src src-yaml">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-yaml" data-lang="yaml"><span class="line"><span class="cl"><span class="nt">services</span><span class="p">:</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="nt">ai-dev</span><span class="p">:</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="nt">build</span><span class="p">:</span><span class="w"> </span><span class="l">.</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="nt">deploy</span><span class="p">:</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">      </span><span class="nt">resources</span><span class="p">:</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">        </span><span class="nt">reservations</span><span class="p">:</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">          </span><span class="nt">devices</span><span class="p">:</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">            </span>- <span class="nt">driver</span><span class="p">:</span><span class="w"> </span><span class="l">nvidia</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">              </span><span class="nt">count</span><span class="p">:</span><span class="w"> </span><span class="l">all</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">              </span><span class="nt">capabilities</span><span class="p">:</span><span class="w"> </span><span class="p">[</span><span class="l">gpu]</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="nt">volumes</span><span class="p">:</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">      </span>- <span class="l">.:/workspace</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">      </span>- <span class="l">~/models:/models</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="nt">ports</span><span class="p">:</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">      </span>- <span class="s2">&#34;8888:8888&#34;</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="nt">qdrant</span><span class="p">:</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="nt">image</span><span class="p">:</span><span class="w"> </span><span class="l">qdrant/qdrant:v1.12.5</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="nt">ports</span><span class="p">:</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">      </span>- <span class="s2">&#34;6333:6333&#34;</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="nt">volumes</span><span class="p">:</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">      </span>- <span class="l">qdrant_data:/qdrant/storage</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="nt">volumes</span><span class="p">:</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="l">qdrant_data:</span></span></span></code></pre></div>
</div>
<p>
Pra AMD, troque o bloco <code>deploy</code> por:</p>
<div class="src src-yaml">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-yaml" data-lang="yaml"><span class="line"><span class="cl"><span class="w">    </span><span class="nt">devices</span><span class="p">:</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">      </span>- <span class="l">/dev/kfd:/dev/kfd</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">      </span>- <span class="l">/dev/dri:/dev/dri</span></span></span></code></pre></div>
</div>
<p>
Um <code>docker compose up -d</code> e seu container de IA enxerga o banco vetorial em <code>http://qdrant:6333</code> pelo nome do serviço. Rede compartilhada, automática, sem configurar IP.</p>
<blockquote>
<p><em>Em miúdos:</em> <code>Container</code> é como uma máquina virtual leve: ele isola seu código, runtime, bibliotecas e ferramentas de sistema num pacote que roda idêntico em qualquer lugar, mas compartilha o kernel do sistema operacional, por isso ele inicia em segundos, não em minutos. <code>Imagem</code> é o molde (construído a partir de um Dockerfile); <code>container</code> é a instância rodando da imagem. <code>Volume</code> é um diretório do seu computador real montado dentro do container, essencial pra modelos de 14 GB que você não quer perder quando o container morrer. <code>Inferência</code> é o ato de usar um modelo já treinado pra fazer predições (vs <code>treinamento</code>, que é ensinar o modelo). <code>flash-attn</code> e <code>bitsandbytes</code> são bibliotecas que otimizam atenção (o mecanismo central dos transformers) e quantização (reduzir precisão dos pesos pra caber em menos memória). <code>Vector database</code> como o Qdrant armazena embeddings, representações numéricas de texto, pra buscas por similaridade, o coração do RAG. E pra GPU: NVIDIA usa <code>--gpus all</code> com o NVIDIA Container Toolkit; AMD usa <code>--device=/dev/kfd --device=/dev/dri</code> pra expor a GPU via ROCm.</p>
</blockquote>
</div>
</div>
