blog/content/post/ai-setup.org
* Editor: seu copiloto silencioso

Você passa mais tempo no editor do que dormindo. Um editor mal configurado é atrito constante: sem autocomplete, sem type hints, sem erros inline, formatação manual. O setup certo leva 20 minutos. Pular ele custa 20 minutos todo dia.

O VS Code é a recomendação porque é grátis, roda em todo OS, tem suporte nativo a Jupyter e o ecossistema de extensões cobre tudo. As extensões essenciais:

#+BEGIN_SRC bash
code --install-extension ms-python.python
code --install-extension ms-python.vscode-pylance
code --install-extension ms-toolsai.jupyter
code --install-extension eamodio.gitlens
code --install-extension ms-vscode-remote.remote-ssh
code --install-extension ms-python.debugpy
code --install-extension ms-python.black-formatter
code --install-extension charliermarsh.ruff
#+END_SRC

O que cada uma faz: Python (detecção de virtualenv, run/debug), Pylance (type checking rápido, autocomplete), Jupyter (notebooks dentro do VS Code), GitLens (git blame inline), Remote SSH (abre pasta em GPU remota como se fosse local), Debugpy (debug passo a passo), Black (formata ao salvar), Ruff (linting rápido).

As settings que importam pra IA:

#+BEGIN_SRC jsonc
{
    "python.analysis.typeCheckingMode": "basic",
    "editor.formatOnSave": true,
    "editor.rulers": [88, 120],
    "notebook.output.scrolling": true,
    "files.autoSave": "afterDelay"
}
#+END_SRC

- /Type checking basic/: pega argumento errado antes de rodar. Salva horas de debug em shape mismatch de tensor.
- /Format on save/: nunca mais pense em formatação. Black resolve.
- /Rulers em 88 e 120/: Black quebra em 88 colunas. O marker de 120 mostra quando docstrings tão longas.
- /Notebook output scrolling/: loop de treino imprime milhares de linhas. Sem scrolling, o painel explode.
- /Auto-save/: você vai esquecer de salvar. Seu script de treino vai rodar código velho. Auto-save previne.

O Remote SSH é a extensão mais importante. Você vai treinar em máquinas remotas. Ela deixa você abrir o filesystem remoto, editar arquivos, rodar terminais e debugar como se fosse local. Configura uma vez no ~~/.ssh/config~:

#+BEGIN_SRC conf
Host gpu-box
    HostName 203.0.113.50
    User ubuntu
    IdentityFile ~/.ssh/id_ed25519
    ForwardAgent yes
#+END_SRC

Depois ~Ctrl+Shift+P > Remote-SSH: Connect to Host > gpu-box~.

#+BEGIN_QUOTE
/Em miúdos:/ ~Type checking~ (verificação de tipos) é o editor inspecionando seu código /antes/ de rodar pra avisar que você passou uma string onde o modelo espera um tensor, pega shape mismatch antes de queimar 6 horas de treino. ~Linting~ é o Ruff ou Pylance analisando seu código por problemas de estilo e bugs comuns (variável não usada, import não utilizado). ~Format on save~ é o Black reformatando seu código automaticamente ao salvar, indentação, espaçamento, quebras de linha, pra você nunca mais pensar nisso. E ~Remote SSH~ é a extensão que instala um servidor leve na máquina remota e faz o VS Code da sua máquina se comportar como se estivesse rodando lá, você edita, debuga e usa o terminal como se a GPU box fosse local.
#+END_QUOTE

#+BEGIN_QUOTE
/Saiba mais:/ se você já usa Vim ou Neovim e é produtivo, fique. O setup mínimo pra Python com IA: pyright (type checking via Mason), nvim-lspconfig, molten-nvim (execução estilo notebook), telescope.nvim (busca), none-ls.nvim com black e ruff. Se você /não/ usa Vim, não comece agora. A curva de aprendizado compete com aprender engenharia de IA. Use VS Code.
#+END_QUOTE

* Git: o mínimo que você precisa

Você vai escrever centenas de arquivos de código. Sem controle de versão, você perde trabalho, quebra coisa sem poder desfazer e não tem como colaborar.

O fluxo diário se resume a cinco comandos:

| Comando | Quando |
|---------+-------|
| ~git clone~ | Clonar o repositório |
| ~git add~ + ~git commit~ | Salvar seu progresso |
| ~git push~ | Fazer backup no GitHub |
| ~git checkout -b~ | Testar algo sem quebrar a main |
| ~git log --oneline~ | Ver o que você fez |

#+BEGIN_SRC bash
git clone https://github.com/rohitg00/ai-engineering-from-scratch.git
cd ai-engineering-from-scratch
git checkout -b my-progress

# trabalha nos arquivos, commita seu código
git add meu-modelo.py
git commit -m "Implementa perceptron do zero"
git push origin my-progress
#+END_SRC

Três coisas pra lembrar: salve sempre (~commit~), faça backup (~push~), ramifique pra experimentos (~checkout -b~). Você não precisa de rebase, cherry-pick ou submodules.

O ~.gitignore~ que evita commitar checkpoints e binários:

#+BEGIN_SRC conf
*.bin
*.safetensors
*.pt
*.pth
*.onnx
.venv/
__pycache__/
#+END_SRC

