ai-setup/index.html
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
Editor: seu copiloto silencioso
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>
Você passa mais tempo no editor do que dormindo. Um editor mal configurado é atrito constante: sem autocomplete, sem type hints, sem erros inline, formatação manual. O setup certo leva 20 minutos. Pular ele custa 20 minutos todo dia.</p>
<p>
O VS Code é a recomendação porque é grátis, roda em todo OS, tem suporte nativo a Jupyter e o ecossistema de extensões cobre tudo. As extensões essenciais:</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl">code --install-extension ms-python.python
</span></span><span class="line"><span class="cl">code --install-extension ms-python.vscode-pylance
</span></span><span class="line"><span class="cl">code --install-extension ms-toolsai.jupyter
</span></span><span class="line"><span class="cl">code --install-extension eamodio.gitlens
</span></span><span class="line"><span class="cl">code --install-extension ms-vscode-remote.remote-ssh
</span></span><span class="line"><span class="cl">code --install-extension ms-python.debugpy
</span></span><span class="line"><span class="cl">code --install-extension ms-python.black-formatter
</span></span><span class="line"><span class="cl">code --install-extension charliermarsh.ruff</span></span></code></pre></div>
</div>
<p>
O que cada uma faz: Python (detecção de virtualenv, run/debug), Pylance (type checking rápido, autocomplete), Jupyter (notebooks dentro do VS Code), GitLens (git blame inline), Remote SSH (abre pasta em GPU remota como se fosse local), Debugpy (debug passo a passo), Black (formata ao salvar), Ruff (linting rápido).</p>
<p>
As settings que importam pra IA:</p>
<div class="src src-jsonc">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-jsonc" data-lang="jsonc"><span class="line"><span class="cl"><span class="p">{</span>
</span></span><span class="line"><span class="cl">    <span class="nt">&#34;python.analysis.typeCheckingMode&#34;</span><span class="p">:</span> <span class="s2">&#34;basic&#34;</span><span class="p">,</span>
</span></span><span class="line"><span class="cl">    <span class="nt">&#34;editor.formatOnSave&#34;</span><span class="p">:</span> <span class="kc">true</span><span class="p">,</span>
</span></span><span class="line"><span class="cl">    <span class="nt">&#34;editor.rulers&#34;</span><span class="p">:</span> <span class="p">[</span><span class="mi">88</span><span class="p">,</span> <span class="mi">120</span><span class="p">],</span>
</span></span><span class="line"><span class="cl">    <span class="nt">&#34;notebook.output.scrolling&#34;</span><span class="p">:</span> <span class="kc">true</span><span class="p">,</span>
</span></span><span class="line"><span class="cl">    <span class="nt">&#34;files.autoSave&#34;</span><span class="p">:</span> <span class="s2">&#34;afterDelay&#34;</span>
</span></span><span class="line"><span class="cl"><span class="p">}</span></span></span></code></pre></div>
</div>
<ul>
<li><em>Type checking basic</em>: pega argumento errado antes de rodar. Salva horas de debug em shape mismatch de tensor.</li>
<li><em>Format on save</em>: nunca mais pense em formatação. Black resolve.</li>
<li><em>Rulers em 88 e 120</em>: Black quebra em 88 colunas. O marker de 120 mostra quando docstrings tão longas.</li>
<li><em>Notebook output scrolling</em>: loop de treino imprime milhares de linhas. Sem scrolling, o painel explode.</li>
<li><em>Auto-save</em>: você vai esquecer de salvar. Seu script de treino vai rodar código velho. Auto-save previne.</li>
</ul>
<p>O Remote SSH é a extensão mais importante. Você vai treinar em máquinas remotas. Ela deixa você abrir o filesystem remoto, editar arquivos, rodar terminais e debugar como se fosse local. Configura uma vez no <code>~/.ssh/config</code>:</p>
<div class="src src-conf">
<pre tabindex="0"><code class="language-conf" data-lang="conf">Host gpu-box
    HostName 203.0.113.50
    User ubuntu
    IdentityFile ~/.ssh/id_ed25519
    ForwardAgent yes</code></pre>
</div>
<p>
Depois <code>Ctrl+Shift+P &gt; Remote-SSH: Connect to Host &gt; gpu-box</code>.</p>
<blockquote>
<p><em>Em miúdos:</em> <code>Type checking</code> (verificação de tipos) é o editor inspecionando seu código <em>antes</em> de rodar pra avisar que você passou uma string onde o modelo espera um tensor, pega shape mismatch antes de queimar 6 horas de treino. <code>Linting</code> é o Ruff ou Pylance analisando seu código por problemas de estilo e bugs comuns (variável não usada, import não utilizado). <code>Format on save</code> é o Black reformatando seu código automaticamente ao salvar, indentação, espaçamento, quebras de linha, pra você nunca mais pensar nisso. E <code>Remote SSH</code> é a extensão que instala um servidor leve na máquina remota e faz o VS Code da sua máquina se comportar como se estivesse rodando lá, você edita, debuga e usa o terminal como se a GPU box fosse local.</p>
</blockquote>
<blockquote>
<p><em>Saiba mais:</em> se você já usa Vim ou Neovim e é produtivo, fique. O setup mínimo pra Python com IA: pyright (type checking via Mason), nvim-lspconfig, molten-nvim (execução estilo notebook), telescope.nvim (busca), none-ls.nvim com black e ruff. Se você <em>não</em> usa Vim, não comece agora. A curva de aprendizado compete com aprender engenharia de IA. Use VS Code.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
Git: o mínimo que você precisa
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>
Você vai escrever centenas de arquivos de código. Sem controle de versão, você perde trabalho, quebra coisa sem poder desfazer e não tem como colaborar.</p>
<p>
O fluxo diário se resume a cinco comandos:</p>
<table>
<thead>
<tr>
<th>Comando</th>
<th>Quando</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>git clone</code></td>
<td>Clonar o repositório</td>
</tr>
<tr>
<td><code>git add</code> + <code>git commit</code></td>
<td>Salvar seu progresso</td>
</tr>
<tr>
<td><code>git push</code></td>
<td>Fazer backup no GitHub</td>
</tr>
<tr>
<td><code>git checkout -b</code></td>
<td>Testar algo sem quebrar a main</td>
</tr>
<tr>
<td><code>git log --oneline</code></td>
<td>Ver o que você fez</td>
</tr>
</tbody>
</table>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl">git clone https://github.com/rohitg00/ai-engineering-from-scratch.git
</span></span><span class="line"><span class="cl"><span class="nb">cd</span> ai-engineering-from-scratch
</span></span><span class="line"><span class="cl">git checkout -b my-progress
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># trabalha nos arquivos, commita seu código</span>
</span></span><span class="line"><span class="cl">git add meu-modelo.py
</span></span><span class="line"><span class="cl">git commit -m <span class="s2">&#34;Implementa perceptron do zero&#34;</span>
</span></span><span class="line"><span class="cl">git push origin my-progress</span></span></code></pre></div>
</div>
<p>
Três coisas pra lembrar: salve sempre (<code>commit</code>), faça backup (<code>push</code>), ramifique pra experimentos (<code>checkout -b</code>). Você não precisa de rebase, cherry-pick ou submodules.</p>
<p>
O <code>.gitignore</code> que evita commitar checkpoints e binários:</p>
<div class="src src-conf">
<pre tabindex="0"><code class="language-conf" data-lang="conf">*.bin
*.safetensors
*.pt
*.pth
*.onnx
.venv/
__pycache__/</code></pre>
</div>
</div>
</div>
