blog/content/post/ai-setup.org
* Dados: o combustível

Modelo nenhum aprende sem dado. E dado de IA raramente vem num .csv arrumadinho, vem em formatos diferentes, tamanhos diferentes, de fontes diferentes. Você precisa saber carregar, converter, dividir e versionar tudo isso sem que vire uma bagunça.

O que vamos fazer aqui: usar a biblioteca ~datasets~ da Hugging Face pra carregar datasets com uma linha, fazer streaming de arquivos que não cabem no disco, converter entre CSV, JSON, Parquet e Arrow, e criar splits de treino/validação/teste com seed fixa pra resultados reprodutíveis. No fim, você tem um pipeline de dados que funciona igual toda vez que roda.

Modelo nenhum funciona sem dado. O ~datasets~ da Hugging Face é a biblioteca padrão pra carregar, fazer streaming, converter formatos e dividir dados:

#+BEGIN_SRC python
from datasets import load_dataset

dataset = load_dataset("imdb")
print(dataset["train"][0])
#+END_SRC

Depois do primeiro download, o cache em ~~/.cache/huggingface/datasets/~ resolve. Pra datasets grandes demais pra caber em disco, use streaming:

#+BEGIN_SRC python
dataset = load_dataset("wikimedia/wikipedia", "20220301.en",
                        split="train", streaming=True)
for i, example in enumerate(dataset):
    print(example["title"])
    if i >= 4: break
#+END_SRC

Streaming carrega linha por linha. A memória fica constante independente do tamanho do dataset.

Formatos e quando usar cada um:

| Formato | Tamanho | Leitura | Ideal para |
|---------+---------+---------+------------|
| CSV | Grande | Lenta | Legibilidade humana, planilhas |
| JSON | Grande | Lenta | APIs, dados aninhados |
| Parquet | Pequeno | Rápida | Analytics, queries colunares |
| Arrow | Pequeno | Mais rápida | Processamento em memória (interno do datasets) |

Pra IA, Parquet é o melhor formato de armazenamento. Arrow é o que você usa em memória. CSV e JSON são pra intercâmbio.

O split de dados que todo projeto ML precisa:

#+BEGIN_SRC python
dataset = load_dataset("imdb", split="train")
split = dataset.train_test_split(test_size=0.2, seed=42)
train_val = split["train"].train_test_split(test_size=0.125, seed=42)

train_ds = train_val["train"]   # 80% de 80% = 64%
val_ds = train_val["test"]       # 20% de 80% = 16%
test_ds = split["test"]          # 20%
#+END_SRC

Sempre fixe a seed. A mesma seed produz o mesmo split toda vez. Sem seed, cada execução embaralha diferente e você nunca sabe se o modelo melhorou ou se os dados mudaram.

Pra versionar datasets grandes, três opções: ~.gitignore~ (pessoal, datasets que você pode refazer download), Git LFS (arquivos grandes no git, 1 GB grátis no GitHub), DVC (controle de versão de dados, integra com S3/GCS). ~.gitignore~ resolve na maioria dos casos.

#+BEGIN_QUOTE
/Em miúdos:/ ~Streaming~ é carregar dados sob demanda, linha por linha, sem baixar o dataset inteiro, ideal pra datasets de 100 GB que não cabem no seu disco. ~Seed~ é a semente do gerador de números aleatórios: fixar a seed (ex: ~seed=42~) faz o embaralhamento ser sempre igual, o que significa que seus resultados são reprodutíveis. ~Split~ é a divisão do dataset em treino (o modelo aprende), validação (você ajusta hiperparâmetros) e teste (avaliação final, intocada até o fim). ~Parquet~ é um formato colunar comprimido do ecossistema Apache, menor e mais rápido que CSV. ~Arrow~ é o formato em memória que o Parquet usa por baixo; a biblioteca ~datasets~ da Hugging Face carrega tudo como Arrow internamente pra acesso sem cópia. ~Git LFS~ (Large File Storage) troca arquivos grandes por ponteiros no git. ~DVC~ (Data Version Control) é tipo git pra dados e modelos, com backend em S3/GCS/Drive.
#+END_QUOTE

