ai-setup/index.html
<div id="outline-container-headline-10" class="outline-2">
<h2 id="headline-10">
Dados: o combustível
</h2>
<div id="outline-text-headline-10" class="outline-text-2">
<p>
Modelo nenhum aprende sem dado. E dado de IA raramente vem num .csv arrumadinho, vem em formatos diferentes, tamanhos diferentes, de fontes diferentes. Você precisa saber carregar, converter, dividir e versionar tudo isso sem que vire uma bagunça.</p>
<p>
O que vamos fazer aqui: usar a biblioteca <code>datasets</code> da Hugging Face pra carregar datasets com uma linha, fazer streaming de arquivos que não cabem no disco, converter entre CSV, JSON, Parquet e Arrow, e criar splits de treino/validação/teste com seed fixa pra resultados reprodutíveis. No fim, você tem um pipeline de dados que funciona igual toda vez que roda.</p>
<p>
Modelo nenhum funciona sem dado. O <code>datasets</code> da Hugging Face é a biblioteca padrão pra carregar, fazer streaming, converter formatos e dividir dados:</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">from</span> <span class="nn">datasets</span> <span class="kn">import</span> <span class="n">load_dataset</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">dataset</span> <span class="o">=</span> <span class="n">load_dataset</span><span class="p">(</span><span class="s2">&#34;imdb&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="n">dataset</span><span class="p">[</span><span class="s2">&#34;train&#34;</span><span class="p">][</span><span class="mi">0</span><span class="p">])</span></span></span></code></pre></div>
</div>
<p>
Depois do primeiro download, o cache em <code>~/.cache/huggingface/datasets/</code> resolve. Pra datasets grandes demais pra caber em disco, use streaming:</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="n">dataset</span> <span class="o">=</span> <span class="n">load_dataset</span><span class="p">(</span><span class="s2">&#34;wikimedia/wikipedia&#34;</span><span class="p">,</span> <span class="s2">&#34;20220301.en&#34;</span><span class="p">,</span>
</span></span><span class="line"><span class="cl">                        <span class="n">split</span><span class="o">=</span><span class="s2">&#34;train&#34;</span><span class="p">,</span> <span class="n">streaming</span><span class="o">=</span><span class="kc">True</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="k">for</span> <span class="n">i</span><span class="p">,</span> <span class="n">example</span> <span class="ow">in</span> <span class="nb">enumerate</span><span class="p">(</span><span class="n">dataset</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="nb">print</span><span class="p">(</span><span class="n">example</span><span class="p">[</span><span class="s2">&#34;title&#34;</span><span class="p">])</span>
</span></span><span class="line"><span class="cl">    <span class="k">if</span> <span class="n">i</span> <span class="o">&gt;=</span> <span class="mi">4</span><span class="p">:</span> <span class="k">break</span></span></span></code></pre></div>
</div>
<p>
Streaming carrega linha por linha. A memória fica constante independente do tamanho do dataset.</p>
<p>
Formatos e quando usar cada um:</p>
<table>
<thead>
<tr>
<th>Formato</th>
<th>Tamanho</th>
<th>Leitura</th>
<th>Ideal para</th>
</tr>
</thead>
<tbody>
<tr>
<td>CSV</td>
<td>Grande</td>
<td>Lenta</td>
<td>Legibilidade humana, planilhas</td>
</tr>
<tr>
<td>JSON</td>
<td>Grande</td>
<td>Lenta</td>
<td>APIs, dados aninhados</td>
</tr>
<tr>
<td>Parquet</td>
<td>Pequeno</td>
<td>Rápida</td>
<td>Analytics, queries colunares</td>
</tr>
<tr>
<td>Arrow</td>
<td>Pequeno</td>
<td>Mais rápida</td>
<td>Processamento em memória (interno do datasets)</td>
</tr>
</tbody>
</table>
<p>
Pra IA, Parquet é o melhor formato de armazenamento. Arrow é o que você usa em memória. CSV e JSON são pra intercâmbio.</p>
<p>
O split de dados que todo projeto ML precisa:</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="n">dataset</span> <span class="o">=</span> <span class="n">load_dataset</span><span class="p">(</span><span class="s2">&#34;imdb&#34;</span><span class="p">,</span> <span class="n">split</span><span class="o">=</span><span class="s2">&#34;train&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="n">split</span> <span class="o">=</span> <span class="n">dataset</span><span class="o">.</span><span class="n">train_test_split</span><span class="p">(</span><span class="n">test_size</span><span class="o">=</span><span class="mf">0.2</span><span class="p">,</span> <span class="n">seed</span><span class="o">=</span><span class="mi">42</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="n">train_val</span> <span class="o">=</span> <span class="n">split</span><span class="p">[</span><span class="s2">&#34;train&#34;</span><span class="p">]</span><span class="o">.</span><span class="n">train_test_split</span><span class="p">(</span><span class="n">test_size</span><span class="o">=</span><span class="mf">0.125</span><span class="p">,</span> <span class="n">seed</span><span class="o">=</span><span class="mi">42</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">train_ds</span> <span class="o">=</span> <span class="n">train_val</span><span class="p">[</span><span class="s2">&#34;train&#34;</span><span class="p">]</span>   <span class="c1"># 80% de 80% = 64%</span>
</span></span><span class="line"><span class="cl"><span class="n">val_ds</span> <span class="o">=</span> <span class="n">train_val</span><span class="p">[</span><span class="s2">&#34;test&#34;</span><span class="p">]</span>       <span class="c1"># 20% de 80% = 16%</span>
</span></span><span class="line"><span class="cl"><span class="n">test_ds</span> <span class="o">=</span> <span class="n">split</span><span class="p">[</span><span class="s2">&#34;test&#34;</span><span class="p">]</span>          <span class="c1"># 20%</span></span></span></code></pre></div>
</div>
<p>
Sempre fixe a seed. A mesma seed produz o mesmo split toda vez. Sem seed, cada execução embaralha diferente e você nunca sabe se o modelo melhorou ou se os dados mudaram.</p>
<p>
Pra versionar datasets grandes, três opções: <code>.gitignore</code> (pessoal, datasets que você pode refazer download), Git LFS (arquivos grandes no git, 1 GB grátis no GitHub), DVC (controle de versão de dados, integra com S3/GCS). <code>.gitignore</code> resolve na maioria dos casos.</p>
<blockquote>
<p><em>Em miúdos:</em> <code>Streaming</code> é carregar dados sob demanda, linha por linha, sem baixar o dataset inteiro, ideal pra datasets de 100 GB que não cabem no seu disco. <code>Seed</code> é a semente do gerador de números aleatórios: fixar a seed (ex: <code>seed=42</code>) faz o embaralhamento ser sempre igual, o que significa que seus resultados são reprodutíveis. <code>Split</code> é a divisão do dataset em treino (o modelo aprende), validação (você ajusta hiperparâmetros) e teste (avaliação final, intocada até o fim). <code>Parquet</code> é um formato colunar comprimido do ecossistema Apache, menor e mais rápido que CSV. <code>Arrow</code> é o formato em memória que o Parquet usa por baixo; a biblioteca <code>datasets</code> da Hugging Face carrega tudo como Arrow internamente pra acesso sem cópia. <code>Git LFS</code> (Large File Storage) troca arquivos grandes por ponteiros no git. <code>DVC</code> (Data Version Control) é tipo git pra dados e modelos, com backend em S3/GCS/Drive.</p>
</blockquote>
</div>
</div>
