blog/content/post/ai-setup.org
* Terminal: onde engenheiros de IA vivem

Treinos rodam no terminal. Logs aparecem no terminal. GPU se monitora no terminal. Servidores remotos se acessam pelo terminal. Se você depende do mouse pra tudo, está deixando velocidade na mesa.

O que vamos fazer aqui: dominar pipes e redirects pra processar logs sem abrir arquivo, usar tmux pra manter treinos rodando depois que você fecha o laptop, monitorar GPU e CPU em tempo real, transferir arquivos pra servidores remotos sem corromper nada, e criar aliases que economizam dezenas de digitações por dia. No fim, o terminal vira uma extensão dos seus dedos, não um obstáculo.

/Piping e redirects/, o básico que você usa todo dia:

#+BEGIN_SRC bash
# Conta quantas vezes "loss" aparece no log
cat train.log | grep "loss" | wc -l

# Extrai só os valores de loss
grep "loss:" train.log | awk '{print $NF}' > losses.txt

# Monitora o log em tempo real filtrando erros
tail -f train.log | grep --line-buffered "ERROR"

# Redireciona stdout e stderr pra arquivos diferentes
python train.py > output.log 2> errors.log

# Ou pro mesmo arquivo
python train.py > train_full.log 2>&1
#+END_SRC

/tmux/, a ferramenta mais útil pra gerenciar treinos longos. Cria sessões persistentes com múltiplos painéis. Você pode desconectar, ir pra casa, reconectar via SSH e o treino continua rodando:

#+BEGIN_SRC bash
tmux new -s training

# Dentro do tmux:
# Ctrl+B, " → divide horizontal
# Ctrl+B, % → divide vertical
# Ctrl+B, setas → navega entre painéis
# Ctrl+B, d → desconecta (treino continua)

# Depois:
tmux attach -t training   # reconecta
tmux ls                    # lista sessões
#+END_SRC

Um setup típico: painel 1 com ~python train.py~, painel 2 com ~watch -n1 nvidia-smi~ (ou ~watch -n1 rocm-smi~ pra AMD), painel 3 com ~tail -f logs/experiment.log~. Três coisas rodando, uma janela.

/Monitoramento/, ~htop~ pra processos do sistema. Pra GPU:

#+BEGIN_SRC bash
# NVIDIA
nvidia-smi
watch -n1 nvidia-smi
nvidia-smi --query-compute-apps=pid,name,used_memory --format=csv

# AMD
rocm-smi
watch -n1 rocm-smi
rocm-smi --showuse
#+END_SRC

O ~nvtop~ também funciona com ambos (NVIDIA e AMD) e mostra barras de uso em tempo real.

/SSH e transferência de arquivos/, quando você aluga GPU na nuvem:

#+BEGIN_SRC bash
ssh user@gpu-box-ip
scp model.pt user@gpu-box-ip:~/models/
scp user@gpu-box-ip:~/results/metrics.json ./
rsync -avz ./data/ user@gpu-box-ip:~/data/   # melhor que scp pra volumes grandes

# Port forward pra acessar Jupyter/TensorBoard remoto localmente
ssh -L 8888:localhost:8888 user@gpu-box-ip
# Agora abre localhost:8888 no navegador
#+END_SRC

Use ~rsync~ em vez de ~scp~ pra qualquer coisa grande. Ele só transfere bytes alterados e retoma conexões interrompidas.

#+BEGIN_QUOTE
/Em miúdos:/ ~stdout~ (standard output) é a saída normal de um programa, o que aparece no terminal quando tudo funciona. ~stderr~ (standard error) é a saída de erro, logs de crash, warnings, exceções. O ~>~ redireciona stdout pra um arquivo; ~2>~ redireciona stderr. O pipe ~|~ conecta a saída de um comando à entrada do próximo, por isso ~cat log | grep "loss"~ funciona: o ~cat~ imprime o arquivo e o ~grep~ filtra o que recebeu. ~Port forward~ (encaminhamento de porta) cria um túnel SSH que mapeia uma porta do servidor remoto pra uma porta local, como se o serviço remoto estivesse rodando na sua máquina. ~Alias~ é um apelido que você dá pra um comando longo no seu ~.bashrc~ pra digitar menos.
#+END_QUOTE

Os aliases que economizam digitação (adicione ao ~~/.bashrc~ ou ~~/.zshrc~):

#+BEGIN_SRC bash
# NVIDIA
alias gpu='nvidia-smi --query-gpu=index,name,utilization.gpu,memory.used,memory.total,temperature.gpu --format=csv,noheader'
# AMD
alias gpu='rocm-smi --showuse --csv'
alias killtraining='pkill -f "python.*train"'
alias ae='source .venv/bin/activate'
alias watchloss='tail -f logs/*.log | grep --line-buffered "loss"'
#+END_SRC

