ai-setup/index.html
<div id="outline-container-headline-11" class="outline-2">
<h2 id="headline-11">
Terminal: onde engenheiros de IA vivem
</h2>
<div id="outline-text-headline-11" class="outline-text-2">
<p>
Treinos rodam no terminal. Logs aparecem no terminal. GPU se monitora no terminal. Servidores remotos se acessam pelo terminal. Se você depende do mouse pra tudo, está deixando velocidade na mesa.</p>
<p>
O que vamos fazer aqui: dominar pipes e redirects pra processar logs sem abrir arquivo, usar tmux pra manter treinos rodando depois que você fecha o laptop, monitorar GPU e CPU em tempo real, transferir arquivos pra servidores remotos sem corromper nada, e criar aliases que economizam dezenas de digitações por dia. No fim, o terminal vira uma extensão dos seus dedos, não um obstáculo.</p>
<p>
<em>Piping e redirects</em>, o básico que você usa todo dia:</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl"><span class="c1"># Conta quantas vezes &#34;loss&#34; aparece no log</span>
</span></span><span class="line"><span class="cl">cat train.log <span class="p">|</span> grep <span class="s2">&#34;loss&#34;</span> <span class="p">|</span> wc -l
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Extrai só os valores de loss</span>
</span></span><span class="line"><span class="cl">grep <span class="s2">&#34;loss:&#34;</span> train.log <span class="p">|</span> awk <span class="s1">&#39;{print $NF}&#39;</span> &gt; losses.txt
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Monitora o log em tempo real filtrando erros</span>
</span></span><span class="line"><span class="cl">tail -f train.log <span class="p">|</span> grep --line-buffered <span class="s2">&#34;ERROR&#34;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Redireciona stdout e stderr pra arquivos diferentes</span>
</span></span><span class="line"><span class="cl">python train.py &gt; output.log 2&gt; errors.log
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Ou pro mesmo arquivo</span>
</span></span><span class="line"><span class="cl">python train.py &gt; train_full.log 2&gt;<span class="p">&amp;</span><span class="m">1</span></span></span></code></pre></div>
</div>
<p>
<em>tmux</em>, a ferramenta mais útil pra gerenciar treinos longos. Cria sessões persistentes com múltiplos painéis. Você pode desconectar, ir pra casa, reconectar via SSH e o treino continua rodando:</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl">tmux new -s training
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Dentro do tmux:</span>
</span></span><span class="line"><span class="cl"><span class="c1"># Ctrl+B, &#34; → divide horizontal</span>
</span></span><span class="line"><span class="cl"><span class="c1"># Ctrl+B, % → divide vertical</span>
</span></span><span class="line"><span class="cl"><span class="c1"># Ctrl+B, setas → navega entre painéis</span>
</span></span><span class="line"><span class="cl"><span class="c1"># Ctrl+B, d → desconecta (treino continua)</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Depois:</span>
</span></span><span class="line"><span class="cl">tmux attach -t training   <span class="c1"># reconecta</span>
</span></span><span class="line"><span class="cl">tmux ls                    <span class="c1"># lista sessões</span></span></span></code></pre></div>
</div>
<p>
Um setup típico: painel 1 com <code>python train.py</code>, painel 2 com <code>watch -n1 nvidia-smi</code> (ou <code>watch -n1 rocm-smi</code> pra AMD), painel 3 com <code>tail -f logs/experiment.log</code>. Três coisas rodando, uma janela.</p>
<p>
<em>Monitoramento</em>, <code>htop</code> pra processos do sistema. Pra GPU:</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl"><span class="c1"># NVIDIA</span>
</span></span><span class="line"><span class="cl">nvidia-smi
</span></span><span class="line"><span class="cl">watch -n1 nvidia-smi
</span></span><span class="line"><span class="cl">nvidia-smi --query-compute-apps<span class="o">=</span>pid,name,used_memory --format<span class="o">=</span>csv
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># AMD</span>
</span></span><span class="line"><span class="cl">rocm-smi
</span></span><span class="line"><span class="cl">watch -n1 rocm-smi
</span></span><span class="line"><span class="cl">rocm-smi --showuse</span></span></code></pre></div>
</div>
<p>
O <code>nvtop</code> também funciona com ambos (NVIDIA e AMD) e mostra barras de uso em tempo real.</p>
<p>
<em>SSH e transferência de arquivos</em>, quando você aluga GPU na nuvem:</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl">ssh user@gpu-box-ip
</span></span><span class="line"><span class="cl">scp model.pt user@gpu-box-ip:~/models/
</span></span><span class="line"><span class="cl">scp user@gpu-box-ip:~/results/metrics.json ./
</span></span><span class="line"><span class="cl">rsync -avz ./data/ user@gpu-box-ip:~/data/   <span class="c1"># melhor que scp pra volumes grandes</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Port forward pra acessar Jupyter/TensorBoard remoto localmente</span>
</span></span><span class="line"><span class="cl">ssh -L 8888:localhost:8888 user@gpu-box-ip
</span></span><span class="line"><span class="cl"><span class="c1"># Agora abre localhost:8888 no navegador</span></span></span></code></pre></div>
</div>
<p>
Use <code>rsync</code> em vez de <code>scp</code> pra qualquer coisa grande. Ele só transfere bytes alterados e retoma conexões interrompidas.</p>
<blockquote>
<p><em>Em miúdos:</em> <code>stdout</code> (standard output) é a saída normal de um programa, o que aparece no terminal quando tudo funciona. <code>stderr</code> (standard error) é a saída de erro, logs de crash, warnings, exceções. O <code>&gt;</code> redireciona stdout pra um arquivo; <code>2&gt;</code> redireciona stderr. O pipe <code>|</code> conecta a saída de um comando à entrada do próximo, por isso <code>cat log | grep &#34;loss&#34;</code> funciona: o <code>cat</code> imprime o arquivo e o <code>grep</code> filtra o que recebeu. <code>Port forward</code> (encaminhamento de porta) cria um túnel SSH que mapeia uma porta do servidor remoto pra uma porta local, como se o serviço remoto estivesse rodando na sua máquina. <code>Alias</code> é um apelido que você dá pra um comando longo no seu <code>.bashrc</code> pra digitar menos.</p>
</blockquote>
<p>
Os aliases que economizam digitação (adicione ao <code>~/.bashrc</code> ou <code>~/.zshrc</code>):</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl"><span class="c1"># NVIDIA</span>
</span></span><span class="line"><span class="cl"><span class="nb">alias</span> <span class="nv">gpu</span><span class="o">=</span><span class="s1">&#39;nvidia-smi --query-gpu=index,name,utilization.gpu,memory.used,memory.total,temperature.gpu --format=csv,noheader&#39;</span>
</span></span><span class="line"><span class="cl"><span class="c1"># AMD</span>
</span></span><span class="line"><span class="cl"><span class="nb">alias</span> <span class="nv">gpu</span><span class="o">=</span><span class="s1">&#39;rocm-smi --showuse --csv&#39;</span>
</span></span><span class="line"><span class="cl"><span class="nb">alias</span> <span class="nv">killtraining</span><span class="o">=</span><span class="s1">&#39;pkill -f &#34;python.*train&#34;&#39;</span>
</span></span><span class="line"><span class="cl"><span class="nb">alias</span> <span class="nv">ae</span><span class="o">=</span><span class="s1">&#39;source .venv/bin/activate&#39;</span>
</span></span><span class="line"><span class="cl"><span class="nb">alias</span> <span class="nv">watchloss</span><span class="o">=</span><span class="s1">&#39;tail -f logs/*.log | grep --line-buffered &#34;loss&#34;&#39;</span></span></span></code></pre></div>
</div>
</div>
</div>
