blog/content/post/ai-setup.org
* Linux pra sobreviver

Você desenvolve no macOS ou Windows. Mas no momento que você aluga uma GPU na nuvem, SSH vai te jogar num Ubuntu. Sem interface gráfica, sem Finder, sem Explorer, só você, o cursor piscando e a pressão de estar pagando por hora.

O que vamos fazer aqui: aprender os 15 comandos que resolvem 95% das situações numa GPU box, navegar, criar e apagar arquivos, instalar pacotes, gerenciar permissões, monitorar processos e disco, transferir arquivos e manter sessões vivas com tmux. Também cobrimos as diferenças macOS vs Linux que mais derrubam gente (spoiler: ~sed~ no macOS é diferente) e como usar WSL2 no Windows. No fim, você não vai mais travar ao ver um terminal Ubuntu.

Os 15 comandos que cobrem 95% do que você faz numa GPU box:

#+BEGIN_SRC bash
# Navegação
pwd && ls -la && cd /path && cd ~ && cd ..

# Arquivos
mkdir -p a/b/c && cp file backup && mv old new && rm file && rm -rf dir/

# Leitura
cat file && head -20 file && tail -20 file && tail -f log.txt && less file

# Busca
grep "error" training.log && grep -r "learning_rate" . && find . -name "*.py"

# Permissões (quando dá "Permission denied")
chmod +x script.sh && chmod 755 deploy.sh && chmod 644 config.yaml

# Pacotes
sudo apt update && sudo apt install -y htop tmux build-essential git curl wget unzip

# Processos
htop && ps aux | grep python && kill 12345 && kill -9 12345

# Disco
df -h && du -sh * && du -sh ~/.cache

# Rede
wget https://example.com/model.bin && curl -O https://example.com/data.tar.gz

# Sessões
tmux new -s train && tmux attach -t train
#+END_SRC

As diferenças macOS vs Linux que mais derrubam gente:

| macOS | Linux | Nota |
|-------+-------+------|
| ~brew install~ | ~sudo apt install~ | Alguns nomes de pacote diferem |
| ~open file.txt~ | ~xdg-open file.txt~ | Mas você não tem GUI na box remota. Use ~cat~ ou ~less~. |
| ~~/.zshrc~ | ~~/.bashrc~ | macOS default é zsh. Linux server geralmente é bash. |
| ~sed -i '' 's/a/b/' file~ | ~sed -i 's/a/b/' file~ | macOS sed exige string vazia depois do ~-i~. |
| Case-insensitive | Case-sensitive | ~Model.py~ e ~model.py~ são dois arquivos diferentes no Linux. |

#+BEGIN_QUOTE
/Saiba mais:/ se você está no Windows, o WSL2 te dá um ambiente Linux real sem dual-boot. ~wsl --install -d Ubuntu-24.04~ no PowerShell (admin). Tudo nessa seção funciona dentro dele. GPU passthrough funciona com drivers instalados no Windows: pra NVIDIA, instale o driver Windows (não o Linux) e o CUDA aparece no WSL2. Pra AMD, o ROCm no WSL2 está em preview, verifique a compatibilidade da sua placa com o programa [[https://www.amd.com/en/developer/rocm-hub.html][ROCm on Windows]].
#+END_QUOTE

