ai-setup/index.html
<div id="outline-container-headline-12" class="outline-2">
<h2 id="headline-12">
Linux pra sobreviver
</h2>
<div id="outline-text-headline-12" class="outline-text-2">
<p>
Você desenvolve no macOS ou Windows. Mas no momento que você aluga uma GPU na nuvem, SSH vai te jogar num Ubuntu. Sem interface gráfica, sem Finder, sem Explorer, só você, o cursor piscando e a pressão de estar pagando por hora.</p>
<p>
O que vamos fazer aqui: aprender os 15 comandos que resolvem 95% das situações numa GPU box, navegar, criar e apagar arquivos, instalar pacotes, gerenciar permissões, monitorar processos e disco, transferir arquivos e manter sessões vivas com tmux. Também cobrimos as diferenças macOS vs Linux que mais derrubam gente (spoiler: <code>sed</code> no macOS é diferente) e como usar WSL2 no Windows. No fim, você não vai mais travar ao ver um terminal Ubuntu.</p>
<p>
Os 15 comandos que cobrem 95% do que você faz numa GPU box:</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-bash" data-lang="bash"><span class="line"><span class="cl"><span class="c1"># Navegação</span>
</span></span><span class="line"><span class="cl"><span class="nb">pwd</span> <span class="o">&amp;&amp;</span> ls -la <span class="o">&amp;&amp;</span> <span class="nb">cd</span> /path <span class="o">&amp;&amp;</span> <span class="nb">cd</span> ~ <span class="o">&amp;&amp;</span> <span class="nb">cd</span> ..
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Arquivos</span>
</span></span><span class="line"><span class="cl">mkdir -p a/b/c <span class="o">&amp;&amp;</span> cp file backup <span class="o">&amp;&amp;</span> mv old new <span class="o">&amp;&amp;</span> rm file <span class="o">&amp;&amp;</span> rm -rf dir/
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Leitura</span>
</span></span><span class="line"><span class="cl">cat file <span class="o">&amp;&amp;</span> head -20 file <span class="o">&amp;&amp;</span> tail -20 file <span class="o">&amp;&amp;</span> tail -f log.txt <span class="o">&amp;&amp;</span> less file
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Busca</span>
</span></span><span class="line"><span class="cl">grep <span class="s2">&#34;error&#34;</span> training.log <span class="o">&amp;&amp;</span> grep -r <span class="s2">&#34;learning_rate&#34;</span> . <span class="o">&amp;&amp;</span> find . -name <span class="s2">&#34;*.py&#34;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Permissões (quando dá &#34;Permission denied&#34;)</span>
</span></span><span class="line"><span class="cl">chmod +x script.sh <span class="o">&amp;&amp;</span> chmod <span class="m">755</span> deploy.sh <span class="o">&amp;&amp;</span> chmod <span class="m">644</span> config.yaml
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Pacotes</span>
</span></span><span class="line"><span class="cl">sudo apt update <span class="o">&amp;&amp;</span> sudo apt install -y htop tmux build-essential git curl wget unzip
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Processos</span>
</span></span><span class="line"><span class="cl">htop <span class="o">&amp;&amp;</span> ps aux <span class="p">|</span> grep python <span class="o">&amp;&amp;</span> <span class="nb">kill</span> <span class="m">12345</span> <span class="o">&amp;&amp;</span> <span class="nb">kill</span> -9 <span class="m">12345</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Disco</span>
</span></span><span class="line"><span class="cl">df -h <span class="o">&amp;&amp;</span> du -sh * <span class="o">&amp;&amp;</span> du -sh ~/.cache
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Rede</span>
</span></span><span class="line"><span class="cl">wget https://example.com/model.bin <span class="o">&amp;&amp;</span> curl -O https://example.com/data.tar.gz
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Sessões</span>
</span></span><span class="line"><span class="cl">tmux new -s train <span class="o">&amp;&amp;</span> tmux attach -t train</span></span></code></pre></div>
</div>
<p>
As diferenças macOS vs Linux que mais derrubam gente:</p>
<table>
<thead>
<tr>
<th>macOS</th>
<th>Linux</th>
<th>Nota</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>brew install</code></td>
<td><code>sudo apt install</code></td>
<td>Alguns nomes de pacote diferem</td>
</tr>
<tr>
<td><code>open file.txt</code></td>
<td><code>xdg-open file.txt</code></td>
<td>Mas você não tem GUI na box remota. Use <code>cat</code> ou <code>less</code>.</td>
</tr>
<tr>
<td><code>~/.zshrc</code></td>
<td><code>~/.bashrc</code></td>
<td>macOS default é zsh. Linux server geralmente é bash.</td>
</tr>
<tr>
<td><code>sed -i &#39;&#39; &#39;s/a/b/&#39; file</code></td>
<td><code>sed -i &#39;s/a/b/&#39; file</code></td>
<td>macOS sed exige string vazia depois do <code>-i</code>.</td>
</tr>
<tr>
<td>Case-insensitive</td>
<td>Case-sensitive</td>
<td><code>Model.py</code> e <code>model.py</code> são dois arquivos diferentes no Linux.</td>
</tr>
</tbody>
</table>
<blockquote>
<p><em>Saiba mais:</em> se você está no Windows, o WSL2 te dá um ambiente Linux real sem dual-boot. <code>wsl --install -d Ubuntu-24.04</code> no PowerShell (admin). Tudo nessa seção funciona dentro dele. GPU passthrough funciona com drivers instalados no Windows: pra NVIDIA, instale o driver Windows (não o Linux) e o CUDA aparece no WSL2. Pra AMD, o ROCm no WSL2 está em preview, verifique a compatibilidade da sua placa com o programa <a href="https://www.amd.com/en/developer/rocm-hub.html">ROCm on Windows</a>.</p>
</blockquote>
</div>
</div>
