blog/content/post/ai-setup.org
* Debugging: quando o código não quebra, mas também não funciona

Código de IA falha diferente de código normal. Uma aplicação web crasha com stack trace, você sabe exatamente onde quebrou. Um loop de treino mal configurado roda por 8 horas, queima $200 em GPU, termina com um sorriso e produz um modelo que prevê a média de todo input. O código nunca deu erro. O problema é silencioso: um tensor no device errado, um ~.detach()~ esquecido, labels vazando pros features de treino.

O que vamos fazer aqui: aprender a debugar em três níveis, Python básico (print, pdb, logging), operações com tensores (shape, device, NaN) e dinâmica de treino (TensorBoard). Vamos construir um arsenal de funções utilitárias (debug_print, NaN detector, data leakage checker, device checker) e aprender a usá-las no momento certo. E tem um glossário com ~20 termos porque, convenhamos, ninguém nasce sabendo o que é backpropagation. No fim, você vai olhar pra um treino que não converge e saber exatamente onde cutucar.

Debugging de IA opera em três níveis:

#+BEGIN_SRC mermaid
graph TD
    L3["3. Dinâmica de treino<br/>Curvas de loss, gradientes, ativações"] --> L2
    L2["2. Operações com tensores<br/>Shapes, dtypes, devices, NaN/Inf"] --> L1
    L1["1. Python padrão<br/>Breakpoints, logging, profiling, memória"]

    classDef l3d fill:#1a202e,stroke:#4a5a7b,color:#b0bcd0
    classDef l2d fill:#1e2438,stroke:#526080,color:#b8c4d4
    classDef l1d fill:#222842,stroke:#5a6888,color:#c0c8d8
    class L3 l3d
    class L2 l2d
    class L1 l1d
#+END_SRC

A maioria pula direto pro nível 3 (olhando TensorBoard). Mas 80% dos bugs de IA vivem nos níveis 1 e 2.

#+BEGIN_QUOTE
/Em miúdos, o vocabulário do debugging de IA:/ ~Tensor~ é a estrutura de dados fundamental: uma matriz multidimensional de números (escalar = tensor 0D, vetor = 1D, matriz = 2D, e assim vai). Tudo no PyTorch é tensor. ~Shape~ são as dimensões, ~[32, 3, 224, 224]~ significa 32 imagens, 3 canais de cor (RGB), 224x224 pixels cada. ~Device~ é onde o tensor mora: ~cpu~ ou ~cuda:0~ (sim, ~cuda:0~ também pra AMD, o PyTorch usa o mesmo nome de device pros dois backends). ~Forward pass~ é o caminho de ida: os dados entram no modelo e saem como predição. ~Backward pass~ (ou backpropagation) é o caminho de volta: o erro da predição é propagado camada por camada pra ajustar os pesos. ~Gradiente~ é a seta que diz "ajuste o peso nessa direção e nessa intensidade". ~Loss function~ (função de perda) mede quão errada a predição está, o treino inteiro existe pra minimizar esse número. ~Optimizer~ é o algoritmo que decide /como/ ajustar os pesos com base nos gradientes (SGD, Adam, etc.). ~Learning rate~ (taxa de aprendizado, ~lr~) controla o tamanho do passo de ajuste, alto demais explode o treino, baixo demais não sai do lugar. ~Batch~ é um subconjunto do dataset processado de uma vez, em vez de passar 50 mil imagens, você passa lotes de 32. ~Batch size~ é o tamanho desse lote. ~NaN~ (Not a Number) aparece quando uma operação matemática produz algo indefinido (divisão por zero, log de negativo). ~Inf~ é infinito, gradientes explodindo. ~Epoch~ é uma passada completa por todo o dataset. ~Overfitting~ é quando o modelo decora o treino e vai mal no teste. ~Vanishing gradients~ é quando os gradientes encolhem tanto nas camadas iniciais que elas param de aprender, comum em redes muito profundas. ~Mixed precision~ treina com 16 bits em vez de 32, reduzindo a memória pela metade com perda mínima de qualidade. ~Gradient checkpointing~ troca computação por memória: recalcula ativações durante o backward em vez de guardá-las. E ~OOM~ (Out of Memory) é o temido "acabou a VRAM", seu modelo não cabe na GPU.
#+END_QUOTE

*Print debugging (sim, funciona)*

Pra código com tensores, um print bem colocado bate stepping em debugger porque você precisa ver shapes, dtypes e intervalos de valores de uma vez:

#+BEGIN_SRC python
def debug_print(name, tensor):
    print(f"{name}: shape={tensor.shape}, dtype={tensor.dtype}, "
          f"device={tensor.device}, "
          f"min={tensor.min().item():.4f}, max={tensor.max().item():.4f}, "
          f"mean={tensor.mean().item():.4f}, "
          f"has_nan={tensor.isnan().any().item()}")
#+END_SRC

Chame depois de toda operação suspeita. Quando o bug for encontrado, remova. Simples.

*pdb e breakpoint condicional*

~breakpoint()~ dentro do loop de treino com condição é uma das coisas mais subestimadas pra debug de IA. Você só para quando algo parece errado, não em todo passo de um treino de 10.000 iterações:

#+BEGIN_SRC python
def training_step(model, batch, criterion, optimizer):
    inputs, labels = batch
    outputs = model(inputs)
    loss = criterion(outputs, labels)

    if loss.item() > 100 or torch.isnan(loss):
        breakpoint()   # só para aqui se algo explodiu

    loss.backward()
    optimizer.step()
#+END_SRC

Dentro do debugger: ~p outputs.shape~, ~p loss.item()~, ~p torch.isnan(outputs).sum()~, ~p model.fc1.weight.grad~. ~c~ pra continuar, ~q~ pra sair.

*Logging (evolutivo)*

Quando o debugging passa de uma checagem rápida, troque prints por logging. Logging te dá timestamps, níveis de severidade e saída em arquivo. Quando o treino falha às 3 da manhã, você quer um arquivo de log, não output de terminal que já scrollou:

#+BEGIN_SRC python
import logging
logging.basicConfig(
    level=logging.INFO,
    format="%(asctime)s [%(levelname)s] %(message)s",
    handlers=[logging.FileHandler("training.log"), logging.StreamHandler()]
)
logger = logging.getLogger(__name__)

logger.info("Iniciando treino: lr=%.4f, batch_size=%d", lr, batch_size)
logger.warning("Spike de loss detectado: %.4f no passo %d", loss.item(), step)
logger.error("NaN loss no passo %d, parando", step)
#+END_SRC

*Profiling: onde o tempo some*

Saber onde o tempo vai é o primeiro passo pra otimizar:

#+BEGIN_SRC python
import time

class Timer:
    def __init__(self, name=""): self.name = name
    def __enter__(self): self.start = time.perf_counter(); return self
    def __exit__(self, *args):
        print(f"[{self.name}] {time.perf_counter() - self.start:.4f}s")

with Timer("data loading"): batch = next(dataloader_iter)
with Timer("forward pass"): outputs = model(batch)
with Timer("backward pass"): loss.backward()
#+END_SRC

Descoberta comum: data loading consome 60% do tempo de treino. A correção é ~num_workers > 0~ no DataLoader, não uma GPU mais rápida. Pra profiling mais pesado: ~python -m cProfile -s cumtime train.py~ (funções por tempo cumulativo) ou ~kernprof -l -v train.py~ com ~line_profiler~ (linha por linha).

*Os cinco bugs de IA mais comuns*

/1. Shape mismatch./ O tensor tem shape ~[batch, features]~ e o modelo espera ~[batch, channels, height, width]~. Use um hook de forward pra mapear toda transformação de shape do modelo uma vez com um batch de amostra.

/2. NaN loss./ Algo explodiu. Causas: learning rate alto demais, divisão por zero na loss customizada, log de número negativo, gradientes explodindo em RNNs. Rodeie com:

#+BEGIN_SRC python
def detect_nan(model, loss, step):
    if torch.isnan(loss):
        print(f"NaN loss no passo {step}")
        for name, param in model.named_parameters():
            if param.grad is not None:
                if torch.isnan(param.grad).any():
                    print(f"  NaN gradient em {name}")
                if torch.isinf(param.grad).any():
                    print(f"  Inf gradient em {name}")
        return True
    return False
#+END_SRC

/3. Data leakage./ Seu modelo acerta 99% no teste na primeira época. Não é skill, é vazamento. Cheque se há sobreposição entre treino e teste:

#+BEGIN_SRC python
def check_data_leakage(train_set, test_set, id_column="id"):
    train_ids = set(train_set[id_column].tolist())
    test_ids = set(test_set[id_column].tolist())
    overlap = train_ids & test_ids
    if overlap:
        print(f"DATA LEAKAGE: {len(overlap)} amostras em treino E teste")
#+END_SRC

/4. Tensor no device errado./ Tensores em dispositivos diferentes geram erro de runtime. Mas às vezes um tensor /silenciosamente/ fica na CPU enquanto tudo mais tá na GPU, e o treino só fica lento.

#+BEGIN_SRC python
def check_devices(model, *tensors):
    model_device = next(model.parameters()).device
    for i, t in enumerate(tensors):
        if t.device != model_device:
            print(f"  WARNING: tensor {i} em {t.device}, modelo em {model_device}")
#+END_SRC

/5. OOM (Out of Memory)./

#+BEGIN_SRC python
print(f"Alocado: {torch.cuda.memory_allocated() / 1e9:.2f} GB")
print(f"Cache: {torch.cuda.memory_reserved() / 1e9:.2f} GB")
#+END_SRC

Respostas, em ordem: reduza batch size, ~torch.cuda.empty_cache()~, ~del tensor~ + ~empty_cache()~, mixed precision (~torch.cuda.amp~), gradient checkpointing.

*TensorBoard*

O TensorBoard mostra o que acontece /dentro/ do treino ao longo do tempo. Instala com ~pip install tensorboard~ e instrumenta:

#+BEGIN_SRC python
from torch.utils.tensorboard import SummaryWriter
writer = SummaryWriter("runs/experimento_1")

for step in range(num_steps):
    loss = train_step(model, batch)
    writer.add_scalar("loss/train", loss.item(), step)
    writer.add_scalar("lr", optimizer.param_groups[0]["lr"], step)
    if step % 100 == 0:
        for name, param in model.named_parameters():
            writer.add_histogram(f"weights/{name}", param, step)
            if param.grad is not None:
                writer.add_histogram(f"grads/{name}", param.grad, step)
writer.close()
#+END_SRC

Rodeia ~tensorboard --logdir=runs~ e abre ~localhost:6006~. O que olhar: loss não desce (lr baixo ou arquitetura errada), loss oscila (lr alto), loss vai pra NaN (instabilidade numérica), loss de treino desce e validação sobe (overfitting), histogramas de peso colapsando pra zero (vanishing gradients).

#+BEGIN_QUOTE
/Saiba mais:/ o fluxo de debugging que pega a maioria dos bugs de IA: 1) Antes de treinar, rode ~check_shapes~ com batch de amostra. 2) Nos primeiros 10 passos, use ~debug_print~ em loss, outputs e gradientes. 3) Durante o treino, faça log de loss, lr e gradientes. Use TensorBoard. 4) Quando algo quebrar, droppe ~breakpoint()~ condicional. 5) Pra performance, meça data loading vs forward vs backward. Profile memória se estiver perto de OOM.
#+END_QUOTE

