ai-setup/index.html
<div id="outline-container-headline-13" class="outline-2">
<h2 id="headline-13">
Debugging: quando o código não quebra, mas também não funciona
</h2>
<div id="outline-text-headline-13" class="outline-text-2">
<p>
Código de IA falha diferente de código normal. Uma aplicação web crasha com stack trace, você sabe exatamente onde quebrou. Um loop de treino mal configurado roda por 8 horas, queima $200 em GPU, termina com um sorriso e produz um modelo que prevê a média de todo input. O código nunca deu erro. O problema é silencioso: um tensor no device errado, um <code>.detach()</code> esquecido, labels vazando pros features de treino.</p>
<p>
O que vamos fazer aqui: aprender a debugar em três níveis, Python básico (print, pdb, logging), operações com tensores (shape, device, NaN) e dinâmica de treino (TensorBoard). Vamos construir um arsenal de funções utilitárias (debug_print, NaN detector, data leakage checker, device checker) e aprender a usá-las no momento certo. E tem um glossário com ~20 termos porque, convenhamos, ninguém nasce sabendo o que é backpropagation. No fim, você vai olhar pra um treino que não converge e saber exatamente onde cutucar.</p>
<p>
Debugging de IA opera em três níveis:</p>
<div class="src src-mermaid">
<pre tabindex="0"><code class="language-mermaid" data-lang="mermaid">graph TD
    L3[&#34;3. Dinâmica de treino&lt;br/&gt;Curvas de loss, gradientes, ativações&#34;] --&gt; L2
    L2[&#34;2. Operações com tensores&lt;br/&gt;Shapes, dtypes, devices, NaN/Inf&#34;] --&gt; L1
    L1[&#34;1. Python padrão&lt;br/&gt;Breakpoints, logging, profiling, memória&#34;]

    classDef l3d fill:#1a202e,stroke:#4a5a7b,color:#b0bcd0
    classDef l2d fill:#1e2438,stroke:#526080,color:#b8c4d4
    classDef l1d fill:#222842,stroke:#5a6888,color:#c0c8d8
    class L3 l3d
    class L2 l2d
    class L1 l1d</code></pre>
</div>
<p>
A maioria pula direto pro nível 3 (olhando TensorBoard). Mas 80% dos bugs de IA vivem nos níveis 1 e 2.</p>
<blockquote>
<p><em>Em miúdos, o vocabulário do debugging de IA:</em> <code>Tensor</code> é a estrutura de dados fundamental: uma matriz multidimensional de números (escalar = tensor 0D, vetor = 1D, matriz = 2D, e assim vai). Tudo no PyTorch é tensor. <code>Shape</code> são as dimensões, <code>[32, 3, 224, 224]</code> significa 32 imagens, 3 canais de cor (RGB), 224x224 pixels cada. <code>Device</code> é onde o tensor mora: <code>cpu</code> ou <code>cuda:0</code> (sim, <code>cuda:0</code> também pra AMD, o PyTorch usa o mesmo nome de device pros dois backends). <code>Forward pass</code> é o caminho de ida: os dados entram no modelo e saem como predição. <code>Backward pass</code> (ou backpropagation) é o caminho de volta: o erro da predição é propagado camada por camada pra ajustar os pesos. <code>Gradiente</code> é a seta que diz &#34;ajuste o peso nessa direção e nessa intensidade&#34;. <code>Loss function</code> (função de perda) mede quão errada a predição está, o treino inteiro existe pra minimizar esse número. <code>Optimizer</code> é o algoritmo que decide <em>como</em> ajustar os pesos com base nos gradientes (SGD, Adam, etc.). <code>Learning rate</code> (taxa de aprendizado, <code>lr</code>) controla o tamanho do passo de ajuste, alto demais explode o treino, baixo demais não sai do lugar. <code>Batch</code> é um subconjunto do dataset processado de uma vez, em vez de passar 50 mil imagens, você passa lotes de 32. <code>Batch size</code> é o tamanho desse lote. <code>NaN</code> (Not a Number) aparece quando uma operação matemática produz algo indefinido (divisão por zero, log de negativo). <code>Inf</code> é infinito, gradientes explodindo. <code>Epoch</code> é uma passada completa por todo o dataset. <code>Overfitting</code> é quando o modelo decora o treino e vai mal no teste. <code>Vanishing gradients</code> é quando os gradientes encolhem tanto nas camadas iniciais que elas param de aprender, comum em redes muito profundas. <code>Mixed precision</code> treina com 16 bits em vez de 32, reduzindo a memória pela metade com perda mínima de qualidade. <code>Gradient checkpointing</code> troca computação por memória: recalcula ativações durante o backward em vez de guardá-las. E <code>OOM</code> (Out of Memory) é o temido &#34;acabou a VRAM&#34;, seu modelo não cabe na GPU.</p>
</blockquote>
<p>
<strong>Print debugging (sim, funciona)</strong></p>
<p>
Pra código com tensores, um print bem colocado bate stepping em debugger porque você precisa ver shapes, dtypes e intervalos de valores de uma vez:</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">debug_print</span><span class="p">(</span><span class="n">name</span><span class="p">,</span> <span class="n">tensor</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;</span><span class="si">{</span><span class="n">name</span><span class="si">}</span><span class="s2">: shape=</span><span class="si">{</span><span class="n">tensor</span><span class="o">.</span><span class="n">shape</span><span class="si">}</span><span class="s2">, dtype=</span><span class="si">{</span><span class="n">tensor</span><span class="o">.</span><span class="n">dtype</span><span class="si">}</span><span class="s2">, &#34;</span>
</span></span><span class="line"><span class="cl">          <span class="sa">f</span><span class="s2">&#34;device=</span><span class="si">{</span><span class="n">tensor</span><span class="o">.</span><span class="n">device</span><span class="si">}</span><span class="s2">, &#34;</span>
</span></span><span class="line"><span class="cl">          <span class="sa">f</span><span class="s2">&#34;min=</span><span class="si">{</span><span class="n">tensor</span><span class="o">.</span><span class="n">min</span><span class="p">()</span><span class="o">.</span><span class="n">item</span><span class="p">()</span><span class="si">:</span><span class="s2">.4f</span><span class="si">}</span><span class="s2">, max=</span><span class="si">{</span><span class="n">tensor</span><span class="o">.</span><span class="n">max</span><span class="p">()</span><span class="o">.</span><span class="n">item</span><span class="p">()</span><span class="si">:</span><span class="s2">.4f</span><span class="si">}</span><span class="s2">, &#34;</span>
</span></span><span class="line"><span class="cl">          <span class="sa">f</span><span class="s2">&#34;mean=</span><span class="si">{</span><span class="n">tensor</span><span class="o">.</span><span class="n">mean</span><span class="p">()</span><span class="o">.</span><span class="n">item</span><span class="p">()</span><span class="si">:</span><span class="s2">.4f</span><span class="si">}</span><span class="s2">, &#34;</span>
</span></span><span class="line"><span class="cl">          <span class="sa">f</span><span class="s2">&#34;has_nan=</span><span class="si">{</span><span class="n">tensor</span><span class="o">.</span><span class="n">isnan</span><span class="p">()</span><span class="o">.</span><span class="n">any</span><span class="p">()</span><span class="o">.</span><span class="n">item</span><span class="p">()</span><span class="si">}</span><span class="s2">&#34;</span><span class="p">)</span></span></span></code></pre></div>
</div>
<p>
Chame depois de toda operação suspeita. Quando o bug for encontrado, remova. Simples.</p>
<p>
<strong>pdb e breakpoint condicional</strong></p>
<p>
<code>breakpoint()</code> dentro do loop de treino com condição é uma das coisas mais subestimadas pra debug de IA. Você só para quando algo parece errado, não em todo passo de um treino de 10.000 iterações:</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">training_step</span><span class="p">(</span><span class="n">model</span><span class="p">,</span> <span class="n">batch</span><span class="p">,</span> <span class="n">criterion</span><span class="p">,</span> <span class="n">optimizer</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">inputs</span><span class="p">,</span> <span class="n">labels</span> <span class="o">=</span> <span class="n">batch</span>
</span></span><span class="line"><span class="cl">    <span class="n">outputs</span> <span class="o">=</span> <span class="n">model</span><span class="p">(</span><span class="n">inputs</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="n">loss</span> <span class="o">=</span> <span class="n">criterion</span><span class="p">(</span><span class="n">outputs</span><span class="p">,</span> <span class="n">labels</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">    <span class="k">if</span> <span class="n">loss</span><span class="o">.</span><span class="n">item</span><span class="p">()</span> <span class="o">&gt;</span> <span class="mi">100</span> <span class="ow">or</span> <span class="n">torch</span><span class="o">.</span><span class="n">isnan</span><span class="p">(</span><span class="n">loss</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">        <span class="n">breakpoint</span><span class="p">()</span>   <span class="c1"># só para aqui se algo explodiu</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">    <span class="n">loss</span><span class="o">.</span><span class="n">backward</span><span class="p">()</span>
</span></span><span class="line"><span class="cl">    <span class="n">optimizer</span><span class="o">.</span><span class="n">step</span><span class="p">()</span></span></span></code></pre></div>
</div>
<p>
Dentro do debugger: <code>p outputs.shape</code>, <code>p loss.item()</code>, <code>p torch.isnan(outputs).sum()</code>, <code>p model.fc1.weight.grad</code>. <code>c</code> pra continuar, <code>q</code> pra sair.</p>
<p>
<strong>Logging (evolutivo)</strong></p>
<p>
Quando o debugging passa de uma checagem rápida, troque prints por logging. Logging te dá timestamps, níveis de severidade e saída em arquivo. Quando o treino falha às 3 da manhã, você quer um arquivo de log, não output de terminal que já scrollou:</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">logging</span>
</span></span><span class="line"><span class="cl"><span class="n">logging</span><span class="o">.</span><span class="n">basicConfig</span><span class="p">(</span>
</span></span><span class="line"><span class="cl">    <span class="n">level</span><span class="o">=</span><span class="n">logging</span><span class="o">.</span><span class="n">INFO</span><span class="p">,</span>
</span></span><span class="line"><span class="cl">    <span class="nb">format</span><span class="o">=</span><span class="s2">&#34;</span><span class="si">%(asctime)s</span><span class="s2"> [</span><span class="si">%(levelname)s</span><span class="s2">] </span><span class="si">%(message)s</span><span class="s2">&#34;</span><span class="p">,</span>
</span></span><span class="line"><span class="cl">    <span class="n">handlers</span><span class="o">=</span><span class="p">[</span><span class="n">logging</span><span class="o">.</span><span class="n">FileHandler</span><span class="p">(</span><span class="s2">&#34;training.log&#34;</span><span class="p">),</span> <span class="n">logging</span><span class="o">.</span><span class="n">StreamHandler</span><span class="p">()]</span>
</span></span><span class="line"><span class="cl"><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="n">logger</span> <span class="o">=</span> <span class="n">logging</span><span class="o">.</span><span class="n">getLogger</span><span class="p">(</span><span class="vm">__name__</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">logger</span><span class="o">.</span><span class="n">info</span><span class="p">(</span><span class="s2">&#34;Iniciando treino: lr=</span><span class="si">%.4f</span><span class="s2">, batch_size=</span><span class="si">%d</span><span class="s2">&#34;</span><span class="p">,</span> <span class="n">lr</span><span class="p">,</span> <span class="n">batch_size</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="n">logger</span><span class="o">.</span><span class="n">warning</span><span class="p">(</span><span class="s2">&#34;Spike de loss detectado: </span><span class="si">%.4f</span><span class="s2"> no passo </span><span class="si">%d</span><span class="s2">&#34;</span><span class="p">,</span> <span class="n">loss</span><span class="o">.</span><span class="n">item</span><span class="p">(),</span> <span class="n">step</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="n">logger</span><span class="o">.</span><span class="n">error</span><span class="p">(</span><span class="s2">&#34;NaN loss no passo </span><span class="si">%d</span><span class="s2">, parando&#34;</span><span class="p">,</span> <span class="n">step</span><span class="p">)</span></span></span></code></pre></div>
</div>
<p>
<strong>Profiling: onde o tempo some</strong></p>
<p>
Saber onde o tempo vai é o primeiro passo pra otimizar:</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">time</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">class</span> <span class="nc">Timer</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">name</span><span class="o">=</span><span class="s2">&#34;&#34;</span><span class="p">):</span> <span class="bp">self</span><span class="o">.</span><span class="n">name</span> <span class="o">=</span> <span class="n">name</span>
</span></span><span class="line"><span class="cl">    <span class="k">def</span> <span class="fm">__enter__</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span> <span class="bp">self</span><span class="o">.</span><span class="n">start</span> <span class="o">=</span> <span class="n">time</span><span class="o">.</span><span class="n">perf_counter</span><span class="p">();</span> <span class="k">return</span> <span class="bp">self</span>
</span></span><span class="line"><span class="cl">    <span class="k">def</span> <span class="fm">__exit__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="o">*</span><span class="n">args</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">        <span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;[</span><span class="si">{</span><span class="bp">self</span><span class="o">.</span><span class="n">name</span><span class="si">}</span><span class="s2">] </span><span class="si">{</span><span class="n">time</span><span class="o">.</span><span class="n">perf_counter</span><span class="p">()</span> <span class="o">-</span> <span class="bp">self</span><span class="o">.</span><span class="n">start</span><span class="si">:</span><span class="s2">.4f</span><span class="si">}</span><span class="s2">s&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">with</span> <span class="n">Timer</span><span class="p">(</span><span class="s2">&#34;data loading&#34;</span><span class="p">):</span> <span class="n">batch</span> <span class="o">=</span> <span class="nb">next</span><span class="p">(</span><span class="n">dataloader_iter</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="k">with</span> <span class="n">Timer</span><span class="p">(</span><span class="s2">&#34;forward pass&#34;</span><span class="p">):</span> <span class="n">outputs</span> <span class="o">=</span> <span class="n">model</span><span class="p">(</span><span class="n">batch</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="k">with</span> <span class="n">Timer</span><span class="p">(</span><span class="s2">&#34;backward pass&#34;</span><span class="p">):</span> <span class="n">loss</span><span class="o">.</span><span class="n">backward</span><span class="p">()</span></span></span></code></pre></div>
</div>
<p>
Descoberta comum: data loading consome 60% do tempo de treino. A correção é <code>num_workers &gt; 0</code> no DataLoader, não uma GPU mais rápida. Pra profiling mais pesado: <code>python -m cProfile -s cumtime train.py</code> (funções por tempo cumulativo) ou <code>kernprof -l -v train.py</code> com <code>line_profiler</code> (linha por linha).</p>
<p>
<strong>Os cinco bugs de IA mais comuns</strong></p>
<p>
<em>1. Shape mismatch.</em> O tensor tem shape <code>[batch, features]</code> e o modelo espera <code>[batch, channels, height, width]</code>. Use um hook de forward pra mapear toda transformação de shape do modelo uma vez com um batch de amostra.</p>
<p>
<em>2. NaN loss.</em> Algo explodiu. Causas: learning rate alto demais, divisão por zero na loss customizada, log de número negativo, gradientes explodindo em RNNs. Rodeie com:</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">detect_nan</span><span class="p">(</span><span class="n">model</span><span class="p">,</span> <span class="n">loss</span><span class="p">,</span> <span class="n">step</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="k">if</span> <span class="n">torch</span><span class="o">.</span><span class="n">isnan</span><span class="p">(</span><span class="n">loss</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">        <span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;NaN loss no passo </span><span class="si">{</span><span class="n">step</span><span class="si">}</span><span class="s2">&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="k">for</span> <span class="n">name</span><span class="p">,</span> <span class="n">param</span> <span class="ow">in</span> <span class="n">model</span><span class="o">.</span><span class="n">named_parameters</span><span class="p">():</span>
</span></span><span class="line"><span class="cl">            <span class="k">if</span> <span class="n">param</span><span class="o">.</span><span class="n">grad</span> <span class="ow">is</span> <span class="ow">not</span> <span class="kc">None</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">                <span class="k">if</span> <span class="n">torch</span><span class="o">.</span><span class="n">isnan</span><span class="p">(</span><span class="n">param</span><span class="o">.</span><span class="n">grad</span><span class="p">)</span><span class="o">.</span><span class="n">any</span><span class="p">():</span>
</span></span><span class="line"><span class="cl">                    <span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;  NaN gradient em </span><span class="si">{</span><span class="n">name</span><span class="si">}</span><span class="s2">&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">                <span class="k">if</span> <span class="n">torch</span><span class="o">.</span><span class="n">isinf</span><span class="p">(</span><span class="n">param</span><span class="o">.</span><span class="n">grad</span><span class="p">)</span><span class="o">.</span><span class="n">any</span><span class="p">():</span>
</span></span><span class="line"><span class="cl">                    <span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;  Inf gradient em </span><span class="si">{</span><span class="n">name</span><span class="si">}</span><span class="s2">&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="k">return</span> <span class="kc">True</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="kc">False</span></span></span></code></pre></div>
</div>
<p>
<em>3. Data leakage.</em> Seu modelo acerta 99% no teste na primeira época. Não é skill, é vazamento. Cheque se há sobreposição entre treino e teste:</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">check_data_leakage</span><span class="p">(</span><span class="n">train_set</span><span class="p">,</span> <span class="n">test_set</span><span class="p">,</span> <span class="n">id_column</span><span class="o">=</span><span class="s2">&#34;id&#34;</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">train_ids</span> <span class="o">=</span> <span class="nb">set</span><span class="p">(</span><span class="n">train_set</span><span class="p">[</span><span class="n">id_column</span><span class="p">]</span><span class="o">.</span><span class="n">tolist</span><span class="p">())</span>
</span></span><span class="line"><span class="cl">    <span class="n">test_ids</span> <span class="o">=</span> <span class="nb">set</span><span class="p">(</span><span class="n">test_set</span><span class="p">[</span><span class="n">id_column</span><span class="p">]</span><span class="o">.</span><span class="n">tolist</span><span class="p">())</span>
</span></span><span class="line"><span class="cl">    <span class="n">overlap</span> <span class="o">=</span> <span class="n">train_ids</span> <span class="o">&amp;</span> <span class="n">test_ids</span>
</span></span><span class="line"><span class="cl">    <span class="k">if</span> <span class="n">overlap</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">        <span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;DATA LEAKAGE: </span><span class="si">{</span><span class="nb">len</span><span class="p">(</span><span class="n">overlap</span><span class="p">)</span><span class="si">}</span><span class="s2"> amostras em treino E teste&#34;</span><span class="p">)</span></span></span></code></pre></div>
</div>
<p>
<em>4. Tensor no device errado.</em> Tensores em dispositivos diferentes geram erro de runtime. Mas às vezes um tensor <em>silenciosamente</em> fica na CPU enquanto tudo mais tá na GPU, e o treino só fica lento.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">check_devices</span><span class="p">(</span><span class="n">model</span><span class="p">,</span> <span class="o">*</span><span class="n">tensors</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">model_device</span> <span class="o">=</span> <span class="nb">next</span><span class="p">(</span><span class="n">model</span><span class="o">.</span><span class="n">parameters</span><span class="p">())</span><span class="o">.</span><span class="n">device</span>
</span></span><span class="line"><span class="cl">    <span class="k">for</span> <span class="n">i</span><span class="p">,</span> <span class="n">t</span> <span class="ow">in</span> <span class="nb">enumerate</span><span class="p">(</span><span class="n">tensors</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">        <span class="k">if</span> <span class="n">t</span><span class="o">.</span><span class="n">device</span> <span class="o">!=</span> <span class="n">model_device</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">            <span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;  WARNING: tensor </span><span class="si">{</span><span class="n">i</span><span class="si">}</span><span class="s2"> em </span><span class="si">{</span><span class="n">t</span><span class="o">.</span><span class="n">device</span><span class="si">}</span><span class="s2">, modelo em </span><span class="si">{</span><span class="n">model_device</span><span class="si">}</span><span class="s2">&#34;</span><span class="p">)</span></span></span></code></pre></div>
</div>
<p>
<em>5. OOM (Out of Memory).</em></p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;Alocado: </span><span class="si">{</span><span class="n">torch</span><span class="o">.</span><span class="n">cuda</span><span class="o">.</span><span class="n">memory_allocated</span><span class="p">()</span> <span class="o">/</span> <span class="mf">1e9</span><span class="si">:</span><span class="s2">.2f</span><span class="si">}</span><span class="s2"> GB&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;Cache: </span><span class="si">{</span><span class="n">torch</span><span class="o">.</span><span class="n">cuda</span><span class="o">.</span><span class="n">memory_reserved</span><span class="p">()</span> <span class="o">/</span> <span class="mf">1e9</span><span class="si">:</span><span class="s2">.2f</span><span class="si">}</span><span class="s2"> GB&#34;</span><span class="p">)</span></span></span></code></pre></div>
</div>
<p>
Respostas, em ordem: reduza batch size, <code>torch.cuda.empty_cache()</code>, <code>del tensor</code> + <code>empty_cache()</code>, mixed precision (<code>torch.cuda.amp</code>), gradient checkpointing.</p>
<p>
<strong>TensorBoard</strong></p>
<p>
O TensorBoard mostra o que acontece <em>dentro</em> do treino ao longo do tempo. Instala com <code>pip install tensorboard</code> e instrumenta:</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">from</span> <span class="nn">torch.utils.tensorboard</span> <span class="kn">import</span> <span class="n">SummaryWriter</span>
</span></span><span class="line"><span class="cl"><span class="n">writer</span> <span class="o">=</span> <span class="n">SummaryWriter</span><span class="p">(</span><span class="s2">&#34;runs/experimento_1&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">for</span> <span class="n">step</span> <span class="ow">in</span> <span class="nb">range</span><span class="p">(</span><span class="n">num_steps</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">loss</span> <span class="o">=</span> <span class="n">train_step</span><span class="p">(</span><span class="n">model</span><span class="p">,</span> <span class="n">batch</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="n">writer</span><span class="o">.</span><span class="n">add_scalar</span><span class="p">(</span><span class="s2">&#34;loss/train&#34;</span><span class="p">,</span> <span class="n">loss</span><span class="o">.</span><span class="n">item</span><span class="p">(),</span> <span class="n">step</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="n">writer</span><span class="o">.</span><span class="n">add_scalar</span><span class="p">(</span><span class="s2">&#34;lr&#34;</span><span class="p">,</span> <span class="n">optimizer</span><span class="o">.</span><span class="n">param_groups</span><span class="p">[</span><span class="mi">0</span><span class="p">][</span><span class="s2">&#34;lr&#34;</span><span class="p">],</span> <span class="n">step</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="k">if</span> <span class="n">step</span> <span class="o">%</span> <span class="mi">100</span> <span class="o">==</span> <span class="mi">0</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">        <span class="k">for</span> <span class="n">name</span><span class="p">,</span> <span class="n">param</span> <span class="ow">in</span> <span class="n">model</span><span class="o">.</span><span class="n">named_parameters</span><span class="p">():</span>
</span></span><span class="line"><span class="cl">            <span class="n">writer</span><span class="o">.</span><span class="n">add_histogram</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;weights/</span><span class="si">{</span><span class="n">name</span><span class="si">}</span><span class="s2">&#34;</span><span class="p">,</span> <span class="n">param</span><span class="p">,</span> <span class="n">step</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">            <span class="k">if</span> <span class="n">param</span><span class="o">.</span><span class="n">grad</span> <span class="ow">is</span> <span class="ow">not</span> <span class="kc">None</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">                <span class="n">writer</span><span class="o">.</span><span class="n">add_histogram</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;grads/</span><span class="si">{</span><span class="n">name</span><span class="si">}</span><span class="s2">&#34;</span><span class="p">,</span> <span class="n">param</span><span class="o">.</span><span class="n">grad</span><span class="p">,</span> <span class="n">step</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="n">writer</span><span class="o">.</span><span class="n">close</span><span class="p">()</span></span></span></code></pre></div>
</div>
<p>
Rodeia <code>tensorboard --logdir=runs</code> e abre <code>localhost:6006</code>. O que olhar: loss não desce (lr baixo ou arquitetura errada), loss oscila (lr alto), loss vai pra NaN (instabilidade numérica), loss de treino desce e validação sobe (overfitting), histogramas de peso colapsando pra zero (vanishing gradients).</p>
<blockquote>
<p><em>Saiba mais:</em> o fluxo de debugging que pega a maioria dos bugs de IA: 1) Antes de treinar, rode <code>check_shapes</code> com batch de amostra. 2) Nos primeiros 10 passos, use <code>debug_print</code> em loss, outputs e gradientes. 3) Durante o treino, faça log de loss, lr e gradientes. Use TensorBoard. 4) Quando algo quebrar, droppe <code>breakpoint()</code> condicional. 5) Pra performance, meça data loading vs forward vs backward. Profile memória se estiver perto de OOM.</p>
</blockquote>
</div>
</div>
